[{
    "unique_id": "pj_a13301076daa0ac2",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Lead Data Analyst - Systems Administration and Analytics",
    "company_name": "NATIONAL GRID CO USA (NE POWER)",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=a13301076daa0ac2",
    "summary": "About us\n\nNational Grid is Hiring a Lead Analyst - Systems Administration and Analytics in our Waltham, MA location.\nEvery day we deliver safe and secure energy to homes, communities, and businesses. We are there when people need us the most. We connect people to the energy they need for the lives they live. The pace of change in society and our industry is accelerating and our expertise and track record puts us in an unparalleled position to shape the sustainable future of our industry.\nTo be successful we must anticipate the needs of our customers, reducing the cost of energy delivery today and pioneering the flexible energy systems of tomorrow. This requires us to deliver on our promises and always look for new opportunities to grow, both ourselves and our business.\nJob Purpose\n\nThe Systems Administration and Analytics department is responsible for managing cross-functional business systems that supports project estimating. You will work closely with leaders across the Capital Delivery organization to improve business processes and identify data driven solutions. Gaining a deep understanding of the requirements that drive business process and the technologies that enable them you will conduct analyses to identify deficiencies, needs, and opportunities to improve our use of technology and data.\nIn this role, you will also interface with end-users from estimating departments and Capital Delivery business areas to identify business capability gaps and opportunities for new and existing systems, collect and document requirements to fill these gaps, support execution of approved plans and systems, maintain and utilize data systems.\nKey Accountabilities\n\nData Analysis & Reporting:\nConduct analysis using statistical software, databases, and spreadsheets (can write advanced macros and maintain complex spreadsheets)\nPerform data cleansing, analysis and monitoring to ensure data quality throughout the end to end process\nManage and integrate multiple sources of data by developing data flows and interpreting data models\nDevelop, build and analyse dashboards and reports to monitor metrics and KPI’s\nData Management:\nChampion data management practices with our stakeholders focused on continuous development of data maturity models\nMonitor data quality scorecards and data integrity efforts with data owners\/stewards to resolve data quality issues\nDatabase \/ Technical:\nWork with data providers in internal client organizations, specifically in the development of data requests, checking of data received and following up with data providers on data issues.\nDevelop scripts and queries, ETL data from different sources utilizing SQL and data ETL software\nAssemble and maintain databases\/data systems\nAbility to transition from legacy systems and processes to efficient best practices\nDeal directly with clients on projects involving technical methodologies\nIdentify opportunities to improve alignment between business processes and systems.\n\nSupervisory\/Interpersonal- Experience Required\n\n Strong interpersonal skills including negotiations and communications.\nAbility to influence key stakeholders and lead a group even where the role holder has no direct authority.\nQualifications\nBachelor’s Degree from an accredited college or university preferably in a technical field required (Engineering, Computer Science, Business Analytics or Management Information Systems)\n7+ years of consistent track record in Analytics and development and application of data management policies and compliance\n3+ years of Database and SQL knowledge\nExperience with utilizing advanced statistical methods and simulations to develop prescriptive and predictive models\nExperience working with large operational data sets, involving categorical data for solving classification problems, is a plus.\nExpert data visualization techniques for charts and reports - Good knowledge of PowerBI, Tableau\nUnstructured Data handling - Know best practices on how to stage unstructured data and model it to solve the problem at hand\nMore Information\n\nNational Grid is an equal opportunity employer that values a broad diversity of talent, knowledge, experience and expertise. We foster a culture of inclusion that drives employee engagement to deliver superior performance to the communities we serve. National Grid is proud to be an affirmative action employer. We encourage minorities, women, individuals with disabilities and protected veterans to join the National Grid team.",
    "salary": "NOT_FOUND",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "pj_4054497532e67c3e",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Quality Assurance Manager",
    "company_name": "Salt Marsh Foods",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=4054497532e67c3e",
    "summary": "job Description: Quality Assurance Manager will manage Quality Assurance department and personnel.Job Responsibilities: The Quality Assurance Manager will direct and manage quality assurance and food safety systems. The Quality Assurance Manager will be responsible for implementing and promoting quality achievement and performance. The position will manage inspections and audits by regulatory agencies (USDA, FDA), customers, and third-party auditing companies. QA manager will direct compliance to quality, GFSI standards, GMP’s, HACCP, sanitation, pest control and Food Defense. QA Manager will be responsible for 1st and 2nd shift QA staff. Flexible schedule will be required.Qualifications: Bachelor's Degree preferred. Associates Degree with relative work experience will be consideredMinimum 5 years-experience managing a quality department in a high volume ready to eat food manufacturing facilityHACCP Certified (Seafood and USDA Meat and Poultry)SQF PractitionerExperienced in the development, implementation, and maintenance of SQF programsStrong knowledge of food safetyEmployee training experienceKnowledge of GFSI, HACCP, GMP’s, SSOP, USDA, and FDAProficient in English, Bilingual Spanish or Portuguese is preferred but not requiredSelf-starter, motivated, self-drivenExcellent writing, reporting, and data gathering abilitiesStrong communication abilitiesStrong computer literacyJob Type: Full-timeApplication QuestionsYou have requested that Indeed ask candidates the following questions:How many years of Quality Assurance experience do you have?How many years of relevant experience do you have?Are you able to work in New Bedford, MA 02740?Job Type: Full-timePay: $65,000.00 - $80,000.00 per yearBenefits:Dental insuranceHealth insurancePaid time offSchedule:HolidaysMonday to FridayWeekendsExperience:relevant: 5 years (Required)Quality Assurance: 5 years (Required)Work Location:One locationBenefit Conditions:Waiting period may applyWork Remotely:No",
    "salary": "\n$65,000 - $80,000 a year",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_fa8212964e29c88f",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Data Analyst\/Planner",
    "company_name": "Garden Remedies, INC.",
    "location": "Fitchburg, MA 01453",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=fa8212964e29c88f",
    "summary": "Data Analyst\/Planner - 1st Shift 6am - 2:30pmJob DescriptionThe responsibilities of the Data Analyst\/Planner within Garden Remedies, Inc. (GRI) broadly embrace the key areas described below.Responsibilities: *Performs daily\/weekly MRPProduces weekly production scheduleReviews testing resultsDetermines shipment quantities to dispensary locations as needed, ensuring sufficient inventory levelsSchedules deliveriesUpdates data tracking sheets, to ensure accuracy of models\/forecastsGathers data from MRP systemProvides information to assist business operationsMaintains extensive knowledge of GRI’s productsIs knowledgeable about MA compliance and reporting regulationsReports inventory issues to managementCompletes other duties as assigned in a timely and appropriate manner**Qualifications:Proficient with Microsoft Office, or highly motivated to acquire necessary skillsExcellent communication skills, both verbal and writtenExtremely high attention to detail, including the ability to detect abnormalities in data and report them to managementDemonstrated history of strong attendance, including the ability to adhere to a strict scheduleThree years’ experience in data analysis\/planning, or equivalent degree preferredKnowledge of Lean\/Six Sigma principles or eager to acquire necessary knowledge preferredAbility to work within a team and maintain a positive attitudeFun attitude and strong work ethicAt least 21 years of age.**Supervision:Works under the general supervision of the Manufacturing ManagerThis position is not responsible for supervising other employees**REQUIRED SKILLSDemonstrated passion to serving the medical and adult-use cannabis community.Excellent communication skillsComputer operating skillsMust be able to pass a background checkMust not have been convicted of any felony offenseMedical marijuana and recreational marijuana product knowledge highly desirableExperience in a complex, fast-paced environmentAbility to genuinely and respectfully connect with coworkers and visitorsDesire to learn more about cannabisOrganization and planning skillsStrong operational skills in a service environmentTeam-building skillsAbility to pass all required background checks to work with cannabisAbility to communicate clearly and concisely, both orally and in writingAbility to build relationships both internally as well as in the communityAbility to handle confidential and sensitive informationAbility to work a set schedule*Job Type: Full-timePay: $18.00 per hourBenefits:Dental insuranceEmployee discountHealth insuranceLife insurancePaid time offVision insuranceSchedule:Monday to FridayThis Company Describes Its Culture as:Detail-oriented -- quality and precision-focusedOutcome-oriented -- results-focused with strong performance cultureStable -- traditional, stable, strong processesCompany's website:www.gardenremedies.comWork Remotely:No",
    "salary": "\n$18 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "pj_187b8c0741729d36",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Part-time Administrative Assistant($16-$18hr)",
    "company_name": "Schulte Staffing Solutions",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=187b8c0741729d36",
    "summary": "Schulte Staffing Solutions is looking to hire an Administrative Assistant for a growing Oil company, in Lynn, MA.Hours & Pay Rate: Part-Time, Mon-Fri: 10a-4p and 11a-5p in the winterFull-Time work is also being consideredPay Rate: $16-$18\/hr Depending on ExperienceYour Role: General administrative data entryAssist Operating Manager with documentation using QuickBooksBalance multiple phone linesDirect calls to the proper correspondentBackground Profile: Pleasant, professional phone mannerAttention to detailAbility to work independently and with a teamBookkeeping experience a plushttps:\/\/www.schultestaffing.com\/contact-us\/Job Types: Full-time, Part-timePay: $16.00 - $18.00 per hourBenefits:Health insuranceSchedule:Monday to FridayExperience:Data Entry: 1 year (Preferred)Administrative: 1 year (Preferred)QuickBooks: 1 year (Preferred)Work Location:One locationBenefit Conditions:Waiting period may applyOnly full-time employees eligibleWork Remotely:No",
    "salary": "\n$16 - $18 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_6ab9f06a35c9d54c",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Business Data Reporting Analyst",
    "company_name": "Tufts Health Plan",
    "location": "Watertown, MA 02472",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=6ab9f06a35c9d54c",
    "summary": "We enjoy the important work we do every day on behalf of our members.\nJob Summary\nWe are looking for an experienced reporting analyst. Under the direction of the Manager of Reporting & Analytics, the reporting analyst will be responsible for working with business and technical stakeholders to support analysis, design, development and testing of various reports that support critical business needs. The analyst will also ensure a high level of advanced customer service increasing the team’s outreach by building and maintaining relationships with other departments and stakeholders at Tufts Health Plan. The analyst is responsible to ensure the analysis and completion of various regulatory reporting requirements, monthly and quarterly claims and financial reporting and other corporate reporting, as well as supporting analysis to other departments such as Health Care Services and the Public Plans and Senior Products Teams.\n\nThe analyst will be required to work with numerous departments across the company and participate in various cross functional workgroups. The analyst must be able to work within a highly effective team as well as work independently to perform analytical and technical tasks.\n\nExcellent and proven ability in utilizing complex reporting and data mining tools such as Cognos, SQL, and MS Access is highly preferred and demonstrated advanced Excel skills are required.\n\nDay-to-day work is a combination of new projects, maintaining existing projects, and standard reporting. This role will work closely with a variety of THP departments including Business Implementation, Regulatory, Product, Strategy & Analytics etc.\nJob Description\nRequirements\nWhat we build together changes our customer's health for the better. We are looking for talented and innovative people to join our team. Come join us!",
    "salary": "NOT_FOUND",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_64369cac597929cc",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Assessors Administrative Assistant",
    "company_name": "CITY OF CHICOPEE",
    "location": "Chicopee, MA 01013",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=64369cac597929cc",
    "summary": "City Of ChicopeeAssessors’ OfficeAdministrative AssistantThe City of Chicopee’s Assessors’ Office is seeking a professional and experienced leader to fulfill the duties in the role of Administrative Assistant. This is an opportunity to dedicate time to help with the needs of others, the City, contribute and be a part of a positive team.The Administrative Assistant performs a variety of secretarial, clerical, and administrative tasks in support of the Board of Assessors and Assistant Assessors. The Administrative Assistant is responsible for the supervision of three clerical positions, recording of all real estate ownership transfers, abatements and denials.Essential Duties include:Supervises other clerical staffManages office payroll records, correspondence and office receiptsPerforms bookkeeping, accounts payable and purchasingIs an expert on real estate transactions and mappingPrimarily responsible for the following:The recording of all real estate transfersReview applications in detail for ownership, income and expense information and personally contacts all applicants that need to submit further information or clarify information.Reviews all deeds for accuracy in conveyance terms and descriptive termsPerforms title research on the Registry of Deeds website and in the officeMaintains property record cards and real estate ownership databasesResponsible for the providing the monthly changes and updates to the Planning Department for the city’s GIS systemChecks list of deeds compiled by document number against entry books at Registry of Deeds. Informs Registry of Deeds of any discrepanciesProcess applications, track mailing, due dates, exemption forms, and accounting of data, bills, tax and property information.Perform other related duties as required or assigned.QUALIFICATIONSTo be minimally qualified for this position, one must meet the following criteria:- High School Diploma or equivalent (GED\/HiSet)- Must have general knowledge of Massachusetts General Laws applying to real estate, personal property, and motor vehicle excise tax.- Accuracy in determining dimensions and areas of plots of land as described in deeds and on Assessors map- General knowledge of office procedures and experience dealing with the public- Ability to analyze deeds for accuracy in details including, but not limited to grantors and descriptions- Ability to meet and complete pre-employment requirementsCOMPENSATIONThe City of Chicopee provides its employees (contingent upon employment status) with a robust benefits package which includes: Medical, Dental, Vision, Sick-Time, Holiday Pay, Personal Time, Vacation Time, Retirement Saving Plans, a Pension Plan, and more. This is a full-time position with a starting pay of Grade A08, at* $22.69 per hour *withperiodic step and pay increases upon continuous completion of employment with the City of Chicopee.HOW TO APPLYIf this opportunity aligns with your skills, experience and employment goals, apply today by one of the following:- Go to chicopeema.gov\/jobs and apply online by selecting ‘Apply Now’- Select ‘download application’* on the City’s employment page and either email it or deliver it along with your resume to resume @chicopeema.gov or the Department of Human Resources, located at Chicopee City Hall, 274 Front Street, 1st Fl. Chicopee, MA. 01013.*Questions? – Contact Paul WinspeareHR Generalist | Recruitment ManagerC: (413) 523-2841E: pwinspeare @chicopeema.govFollow us on social media: Facebook: ChicopeeCareers (@MAChicopeeCareers)Linkedin: City of Chicopee (@city-of-chicopee)The City of Chicopee is an Affirmative Action and Equal Opportunity Employer.Job Type: Full-timePay: From $22.69 per hourBenefits:Dental insuranceDisability insuranceEmployee assistance programFlexible spending accountHealth insuranceLife insurancePaid time offParental leaveProfessional development assistanceRetirement planVision insuranceSchedule:Monday to FridayExperience:Data Entry: 5 years (Required)Accounts Payable: 1 year (Required)MUNIS Software: 2 years (Preferred)GIS: 1 year (Required)administrative assistant: 2 years (Required)Property, Excise Tax: 1 year (Required)Education:High school or equivalent (Required)Work Location:One locationTypical start time:9AMTypical end time:5PMSetting:LegalFinancial Duties:Expense reportsProcessing paymentsBillingPayrollPurchasingCompany's website:chicopeema.gov\/jobsCompany's Facebook page:www.facebook.com\/MAChicopeeCAREERS\/Benefit Conditions:Only full-time employees eligibleWork Remotely:No",
    "salary": "\nFrom $22.69 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "pj_df2c10a359d66a49",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "STEM Instructor",
    "company_name": "Inventor STEM School",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=df2c10a359d66a49",
    "summary": "Inventor STEM School offers innovative enrichment programs in science, engineering, robotics, architecture, and coding for children from 3-16 years old. With 32 STEM learning centers in Europe, we’re now opening our first US-based center in Bedford, MA!We’re recruiting for full-time and part-time STEM Instructors who want to engage and inspire the next generation! Reporting to the Head of US Operations, you will be responsible for delivering an excellent in-person learning experience for children, representing Inventor to parents and children with a high degree of professionalism, and collaborating and communicating with the administrative team and fellow instructors.Teaching\/Classroom: Teach students utilizing Inventor curriculum, teaching tools, and other materialsCreate a fun and engaging atmosphere for our studentsMaintain data in student information systemOrganize and maintain classrooms, equipment, and suppliesKeep a pulse on student’s interest\/engagement in lessonsTraining\/Preparation: Adequately prepare for each course and lesson by reading curriculum, watching training videos and\/or participating in face-to-face training sessionsParticipate in comprehensive curriculum training during onboardingParticipate in periodic trainings and staff meetingsParents\/Enrollment: Maintain positive, effective communication with parentsHandle inquiries from parents regarding our programsEncourage students and parents to enroll students in future coursesBe able to respond to parent questions about their child’s progressMay perform other duties and responsibilities as assignedCharacteristicsEnthusiasm for working with childrenMature and responsibleStrong communication skills, especially in communication with parentsAbility to manage and organize instructional and classroom materialsAbility to establish and maintain cooperative and effective working relationships with othersPunctual and professionalOutgoing, friendly personality (preferred)Knowledge\/Experience\/EducationKnowledge of the course materialPassion for specific STEM topics (preferred)Some collegeCollege degree (preferred)2+ years teaching exp. (may incl. coaching, camp, after-school programs, etc.)Computer skills (e.g. Word, Excel, e-mail)For Instructors teaching preschool age classes, some knowledge and\/or coursework in developmental psychology or early childhood education is also required.At Inventor STEM School, we believe that diverse teams make the strongest teams. We strongly encourage people from all backgrounds to apply, and we look forward to getting to know you!Please note:  stated pay range correlates to degree of experience, education, and specialized knowledge relevant to specific coursesJob Types: Full-time, Part-timePay: $19.00 - $27.00 per hourBenefits:Paid time offCOVID-19 considerations:We have developed a comprehensive plan to safeguard our instructors, staff, and students including: mandatory masks and hand-washing; installation of clear dividers and distancing markers; sanitizing protocols; low density classes.Work authorization:United States (Required)Work Location:One locationHours per week:Less than 1010-1920-2930-39This Job Is:A good job for someone just entering the workforce or returning to the workforce with limited experience and educationOpen to applicants who do not have a college diplomaCompany's Facebook page:https:\/\/www.facebook.com\/InventorSTEMSchool\/Benefit Conditions:Only full-time employees eligibleWork Remotely:No",
    "salary": "\n$19 - $27 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_3df64e74060ef055",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Big Data Architect",
    "company_name": "Quantiphi Inc.",
    "location": "Marlborough, MA",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=3df64e74060ef055",
    "summary": "Required Skills: Bachelor degree in Computer Science, Mathematics or a related technical field or equivalent practical experience.Certifications (Nice to have)o Minimum: Google Professional Data Engineer, Google Professional Cloud Architecto Preferred: AWS Big Data Specialty Certification8-14 years of experience working in Enterprise Data Warehouse technologies in a customer facing role working with enterprise clients.Experience in migration from Teradata to BQ, Hadoop to BQ.Experience with architecting, implementing and\/or maintaining technical solutions in virtualized environments.Experience in design, architecture and implementation of Data warehouses, data pipelines and flows.Experience with reading software code in one or more languages such as Java, Python and SQL.Experience designing and deploying large scale distributed data processing systems with few technologies such as Oracle, MS SQL Server, MySQL, PostgreSQL, MongoDB, Cassandra, Redis, Hadoop, Spark, HBase, Vertica, Netezza, Teradata, Tableau, Qlik or MicroStrategy.In-depth knowledge of Cloud Bigtable, Cloud Dataproc, Apache Beam, Cloud Pub\/Sub, GKE, BigQuery.Customer facing migration experience, including service discovery, assessment, planning, execution, and operations.Demonstrated excellent communication, presentation, and problem-solving skills.Experience in project governance and enterprise customer management.Willingness to travel around 30%-40%.Job Type: Full-timeSalary: From $130,000.00 per yearSchedule:Monday to FridayEducation:Bachelor's (Required)Work Location:Multiple locationsCompany's website:www.quantiphi.comBenefit Conditions:Only full-time employees eligibleWork Remotely:Yes",
    "salary": "\nFrom $130,000 a year",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "pj_fc5bc2af0d48b5a0",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Relief Receptionist (as needed)",
    "company_name": "St. Mary's Center for Women and Children",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=fc5bc2af0d48b5a0",
    "summary": "St. Mary's Center for Women and Children offers innovative and family-centered programs for women and children who have experienced trauma and are living in poverty. Placing families at the center of our efforts, St. Mary’s Center works in partnership with young women, many of them mothers, to break the intergenerational cycle of poverty and achieve lasting, powerful change by building their emotional well-being, educational achievements and economic independence.We currently have openings for Relief Receptionists to provide as coverage as needed for the front desk. The individual in this role will oversee the central reception area by answering phone calls, greeting visitors, distributing mail, and providing program support, as well as other administrative support as needed.Nature and Scope:These duties are not meant to be all-inclusive and may be adjusted as necessary upon discussion.JOB DUTIESOFFICE DUTIES & ORGANIZATIONAs the face of the organization, the individual in this role will be the first point of in person contact and provide and maintain clear and respectful communication with other staff, clients, families and community partners.Completes all typing, photocopying, collating, filing and general correspondence as requested in an accurate and timely manner.Sorts and distributes the agency mail and handle outgoing forwarded\/return mail daily.Completes all data entry request in a timely manner.Ensures office equipment’s are maintained and in good working condition.Retrieves all program daily census for Reception Handbook via email.Maintains consistent professional, legal and ethical standards in accordance with Federal, State and Agency laws).Knowledgeable and compliant with program specific policies, procedures, rules and regulations.Maintains safety, appearance and cleanliness of the facility in compliance with health, fire and safety regulations.Keeps the front desk in an organized manner.Develops and maintains positive relationships with all customers.Serves as a positive role model following the organization guidelines for professional appearance and behavior.Reviews security alerts.Other duties as assigned.RECEPTIONGreets all visitors and notify staff members of their arrival or direct them to the proper destination.Communicates any security concerns appropriately to the Executive Assistant and leadership team member on-call.Answers telephone, retrieves voicemail and forward incoming calls or take accurate messages if appropriate party is not available.Provides referral information on phone inquiries regarding shelter.Sends outgoing faxes as requested.Accepts packages only for St. Mary’s and direct all other deliveries to tenant partner locations.Accurately schedule meetings and functions in calendar and process paperwork.PROFESSIONAL GROWTH AND DEVELOPMENTAttends applicable workshops and utilizes supervisor’s participation and contribution towards professional growth.Participates in staff meetings and training opportunities.Engages in self-evaluation to establish goals for professional development.JOB REQUIREMENTSHigh School Diploma and formal secretarial training or equivalent combination of experience and training that provides the required knowledge, skills and abilities.At least two years’ basic office management\/secretarial experience.Basic word processing and computer skills using Microsoft Office 365.Other Requirements:Ability to engage in collaborative relationship with multidisciplinary teamPleasant telephone demeanor.Patient, understanding, and supportive to the needs of customers and colleagues.Excellent oral and written communication, interpersonal and customer satisfaction skills.A valid MA driver’s license is preferred. Must undergo a background check, in accordance with local law\/regulations.***Applicants must submit a cover letter to be considered for the position. ***Job Type: Part-timeSchedule:Day shiftMonday to FridayNight shiftOn callWeekendsExperience:Office 365: 2 years (Required)Office: 2 years (Required)Education:High school or equivalent (Required)Shifts:Mid-Day (Preferred)Evening (Preferred)Morning (Preferred)Working Days:Monday (Preferred)Tuesday (Preferred)Wednesday (Preferred)Thursday (Preferred)Friday (Preferred)Saturday (Preferred)Sunday (Preferred)Administrative Duties:Stocking suppliesSorting and sending mailAnswering and routing phone callsGreeting visitorsWork Remotely:No",
    "salary": "NOT_FOUND",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "pj_edc3a0bec267785a",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Controller (Direct Hire)",
    "company_name": "Personnel People",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=edc3a0bec267785a",
    "summary": "Abilities and Qualifications: · Management\/supervision of the US accounting department staff and coordination on International Accounting issues on the monthly consolidation\/close· Internal control reviews and testing within the company to ensure accuracy and compliance with internal policies and procedures· Working with company’s counterparts, establishment and maintenance over the accounting processes to track revenue, expenses, assets and liabilities, particularly as it relates to Oracle ERP· Performs internal control reviews and testing within the company to ensure accuracy and compliance with internal policies and procedures· Reviews financial statements for completeness and accuracy with some general ledger and consolidation responsibilities· Assisting in the internal and external financial reporting and regulatory compliance with reporting\/accounting regulations including annual and quarterly reporting· Develops accounting for complex transactions including position statements in memo form· Financial compliance with contractual obligations, including royalty accounting and reporting, debt covenants, government compliance reporting, and implementation of systems to track same;· Management of the external audit relationships as it pertains to North America· Work closely with ERP team to ensure all data feeds, inventory transactions, project management accounting and monthly internal\/external reporting is appropriately captured and tracked in the Company’s Oracle system· Timely and efficient monthly and quarterly close through the accounting staff, and prepare segment reporting, if required;Hours:Monday through Friday8am – 5pmThe salary is up to $180K a year based on experiencePersonnel People – Employment AgencyPersonnel People is an Equal Opportunity Employer. We do not discriminate on the basis of race, religion, color, sex, age, national origin, or disabilityIND1Job Type: Full-timeSchedule:Monday to FridayWork Remotely:No",
    "salary": "\nUp to $180,000 a year",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_cfc33938c11aedea",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Talent Coordinator",
    "company_name": "Circle",
    "location": "Massachusetts",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=cfc33938c11aedea",
    "summary": "Circle is a global financial technology firm that enables businesses of all sizes to harness the power of stablecoins and public blockchains for payments, commerce and financial applications worldwide. Circle's platform has supported over 100 million transactions worth tens of billions of dollars, with nearly 10 million retail customers, over a thousand businesses, while storing and securing more than $5 billion in digital currency assets. Today, Circle's transactional services, business accounts, and platform APIs are giving rise to a new generation of financial services and commerce applications that hold the promise of raising global economic prosperity for all through programmable internet commerce.\n\nWhat you'll be part of:\n\nWith the mission \"To raise global economic prosperity through programmable internet commerce,\" Circle was founded on the belief that blockchains and digital currency will rewire the global economic system, creating a fundamentally more open, inclusive, efficient and integrated world economy. We envision a global economy where people and businesses everywhere can more freely connect and transact with each other with new technologies for digital money. We believe such a system can raise prosperity for people and companies everywhere. Our mission is powered by the values we espouse and which we expect all Circlers to respect. We are Multistakeholder, serving the needs of our customers, our shareholders, our employees and families, our local communities and our world. Furthermore, we are also Mindful, Driven by Excellence, and High Integrity.\n\nWhat you'll be responsible for:\n\nAs a Talent Coordinator, you'll join a team focused on helping Circle's employees be as effective as possible. You will assist in the company's growth and scale by providing the best in class service to Circle's global workforce. You will work closely with the other members of the Talent team to understand and master current processes, then find ways to streamline and improve, and ultimately own them. We're looking for an ambitious, quick-learning, highly motivated individual who seeks a collaborative, iterative, and fast-paced environment. You will have an opportunity to grow your career in an exponential way but will require your hard work and dedication.\n\nWhat you'll work on:\n\nAdminister global health, dental, vision, life and other insurance plan benefits including enrollments, changes, and terminations. Assist in the annual renewal process. Conduct audits of talent systems and invoices to ensure accuracy and consistency.\nProvide ad hoc administrative support and assistance to the SVP, Talent and other members of the Talent team.\nCoordinate interviews and assist with the recruitment process.\nFacilitate payroll processes for US and international locations.\nPerform US and international onboarding processes such as background checks, I-9 documentation, benefit education, HRIS data entry, and scheduling coordination.\nAssist with processing of terminations including updating HRIS, benefits, and COBRA administration.\nParticipate in other Talent duties as assigned such as immigration, talent reporting and analytics, equity administration, policy implementation, process documentation, and employee communication.\n\nYou will aspire to our four core values:\n\nMultistakeholder - you have dedication and commitment to our customers, shareholders, employees and families and local communities.\nMindful - you seek to be respectful, an active listener and to pay attention to detail.\nDriven by Excellence - you are driven by our mission and our passion for customer success which means you relentlessly pursue excellence, that you do not tolerate mediocrity and you work intensely to achieve your goals.\nHigh Integrity - you seek open and honest communication, and you hold yourself to very high moral and ethical standards. You reject manipulation, dishonesty and intolerance.\n\nWhat you'll bring to Circle:\n\nStrong work ethic with aspirations to advance career.\nExtreme attention to detail and ability to stay organized.\nExcellent communication skills, both written and verbal.\nCan do, customer-focused attitude.\nMature ability to keep information confidential.\n1+ years of experience with Human Resources.\nBachelor's degree preferred but not required.\n\nWe are an equal opportunity employer and value diversity at Circle. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
    "salary": "NOT_FOUND",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "pj_537e0c45e7eed45e",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Construction Estimator- Local Candidates Only",
    "company_name": "Polhemus Savery DaSilva Architects Builders",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=537e0c45e7eed45e",
    "summary": "Polhemus Savery DaSilva (PSD) Architects Builders is nationally recognized for thoughtful architectural design and quality construction throughout Cape Cod, Martha’s Vineyard, Nantucket, and southeastern New England. The Estimator is responsible for analyzing project plans, develops scopes of work, and prepares detailed cost estimates.Essential duties and responsibilities include: Review plans and architectural drawings; prepare quantity take-offs on assigned projects.Ensure a complete review of plans and drawings. Identify items that have been omitted and ensure appropriate accounting for such items in overall estimate package that represents the full scope of the project.Solicit subcontractor bids for assigned projects. Obtain a minimum of 3 bids for each trade and supplier group. Review and analyze bids for conformance to project specifications, price, material quality and related items. Discusses and resolves any questions with subcontractor prior to submission of final estimate.Follow approved estimating practices consistent with company guidelines. Ensure such practices result in the most complete estimates possible while ensuring the financial objectives are met.Utilizes appropriate software programs to calculate, record and track estimates. Maintains skills at utilizing appropriate software to provide optimal job performance.As requested, attends client meetings to discuss estimates, answering any questions and resolving any issues regarding pricing and estimates.Organizes and manages a centralized cost estimating database and a formal process to support cost estimating to ensure historical data is utilized.Qualifications4 year Degree, Construction Management Degree, or equivalent work experience.5+ years of work experience in estimating construction, residential construction preferred.Knowledge of principles and practices of residential construction.Knowledge of construction cost control and basic accounting procedures.Timberline Construction Software experience preferred.Advanced proficiency in MS Office - Microsoft Word & Excel.Possess analytical skills and research skills to define and solve problems.Must possess a positive, \"can do\" attitude.Working Conditions & Physical DemandsField and\/or office environment.Travel to the site, and off-site locations will be required.May be exposed to hazardous working environments with heavy machinery.Reaching above and below, stooping and bending.Lifting\/carrying\/moving up to 50 pounds.Job Type: Full-timeBenefits:401(k)401(k) matchingDental insuranceDisability insuranceHealth insuranceLife insurancePaid time offVision insuranceSchedule:Monday to FridayExperience:high-end residential construction: 5 years (Preferred)estimating: 5 years (Required)Education:Bachelor's (Preferred)Work Location:One locationLabor type:ConstructionTypical start time:8AMTypical end time:5PMPay Frequency:WeeklyThis Company Describes Its Culture as:Detail-oriented -- quality and precision-focusedTeam-oriented -- cooperative and collaborativeStable -- traditional, stable, strong processesCompany's website:www.psdab.comCompany's Facebook page:https:\/\/www.facebook.com\/psdabBenefit Conditions:Waiting period may applyWork Remotely:No",
    "salary": "NOT_FOUND",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "pj_511726a70f6d94f1",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "General Cleaner",
    "company_name": "FM&M Inc.",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=511726a70f6d94f1",
    "summary": "We are looking for a Cleaner to take care of our facilities and carry out cleaning and maintenance duties. The goal is to keep our building in a clean and orderly condition.ResponsibilitiesClean, stock and supply designated facility areas (dusting, sweeping, vacuuming, mopping, cleaning ceiling vents, restroom cleaning etc)Perform and document routine inspection and maintenance activitiesCarry out heavy cleansing tasks and special projectsNotify management of occurring deficiencies or needs for repairsMake adjustments and minor repairsStock and maintain supply roomsCooperate with the rest of the staffFollow all health and safety regulationsSkillsProven working experience as a cleanerAbility to handle heavy equipment and machineryKnowledge of cleaning chemicals and suppliesFamiliarity with Material Safety Data SheetsIntegrityHigh school degreeJob Type: Part-timePay: $14.14 per hourSchedule:Monday to FridayExperience:janitorial: 2 years (Required)cleaning: 2 years (Required)Language:Spanish (Preferred)Work authorization:United States (Required)Hours per week:20-29Typical start time:4PMTypical end time:9PMCleaning Equipment:Floor bufferFloor waxerFloor stripperFloor burnisherPay Frequency:WeeklyThis Job Is:A job for which military experienced candidates are encouraged to applyWork Remotely:No",
    "salary": "\n$14.14 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "pj_dbbe56716dcce8e5",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Medical Director Pharmacovigilance",
    "company_name": "TechData Service Company, LLC",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=dbbe56716dcce8e5",
    "summary": "Job Title: Medical Director Pharmacovigilance (Prefer local Boston candidates but can be fully remote)Duration: 6 month and have a chance to extendLocation: Boston, MAJob Description: *MUST HAVE STRONG NDA SUBMISSIONS EXPERIENCE WITHIN PHARMACOVIGILANCE*Experienced Medical Director to Provide Strategic and Hands On Development of NDA Submission ActivitiesOBJECTIVES: Oncology experience preferredPreferable experience with strategy for NDA submissionsUnderstanding of safety data flow and data analysis for NDA submission, ability to develop timelines for documents preparation, provide hands on work in NDA submission activities, e.g., data analysis and writing of ISS, development of CCSI\/CCDS and subsequent label,, participation in safety data and content verification for module 2.7.3 Summary of safety as well as module 2.5 Clinical overview-risk\/benefit analysis); module 2.7.3 Summary of efficacy (safety contributes to review module 2.7.4 summary of safety; and responding to an expected barrage of ongoing queries from Health Authorities.Ability to work with large volume of data and TLFs is an essential skill for this position.Additional activities may include Clinical Study reports writing, protocol amendments writing, TLFs review and communications with biostatisticians.Experience in Risk Management Plan (RMP) content writing and inter-functional coordination is desirable.Able to quickly learn safety profile of an assigned product, perform routine PV activities like daily SAEs review, monthly signal detection (including running of reports from a safety database), preparation of quarterly safety data overview and slides preparation for quarterly safety review meetings for designated global\/regional product(s), in collaboration with product global safety lead.ACCOUNTABILITIES: Intimate knowledge of safety, including any emerging safety concerns and development risk\/benefit profileResponsible for development of documents and for negotiation with Regulatory authorities on safety matters involving these compounds. This includes but is not limited to: authorship of safety summaries to support development of the PI\/SmPC, significant contribution to NDAs,This position will perform activities of both Senior Level PV Scientist responsible for data preparation and analysis and of Global PV physician:- Review and oversight of safety data, both non-clinical and clinical in collaboration with an assigned product Global Safety Lead- Review of protocols, SAPs, clinical study reports, IBs, and other documents developed for submission to regulatory authorities in collaboration with an assigned product Global Safety Lead- Preparation and review of safety data - Participation in the development of a Risk Management Plan- Participation in data analysis and writing of regulatory submission documents-EDUCATION, EXPERIENCE, KNOWLEDGE AND SKILLS: Prefer MD, PhD, or PharmD with minimum of 6 years experience in Pharmacovigilance, experience with leading NDA submission activities is highly desirableAbility to work with large sets of dataStrategical thinking and ability to make high level decisionsExcellent oral and written communication skills including ability to present to large internal\/external groupsGood level of computer literacy with Microsoft applicationsJob Type: ContractPay: $76.00 - $93.00 per hourBenefits:Dental insuranceHealth insuranceSchedule:Monday to FridayWork Remotely:Temporarily due to COVID-19",
    "salary": "\n$76 - $93 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_3e2d8769b4c7e040",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Derivative Operations Analyst Investment trade operations Exp",
    "company_name": "Infolob",
    "location": "Springfield, MA",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=3e2d8769b4c7e040",
    "summary": "Bachelor's Degree in Finance, Business and or Accounting5+ years of investment trade operations experience with an understanding of systems and data management.Understanding of the Investment Management process and the related data flows.Ability to work with investment data providers and consumers to analyze, understand issues and assist in issue resolution.Strong collaboration skills and the ability to work in a team-based environment.Excellent communication skills with ability to address and resolve conflicts diplomatically.Preferred qualificationsExperience with Calypso Investment SystemsExperience in Life Insurance and\/or Investment Management a plusRemarks:Skills:ACCOUNTINGDATA MANAGEMENTEXCELLENT COMMUNICATION SKILLSHEDGINGLIFE CYCLEAdditionalOPERATIONSRECONCILIATIONTRADE RECONCILIATIONANNUITIESAUDITCALYPSOCORPORATE FINANCEDERIVATIVESDISABILITYFINANCELIFE INSURANCELOANSMORTGAGEPRICINGRECONCILIATIONSJob Type: ContractPay: $30.00 - $35.00 per hourExperience:Operations Analyst: 5 years (Required)trade operations: 1 year (Required)Calypso Investment: 1 year (Preferred)accounting: 1 year (Preferred)Location:Springfield, MA (Required)Application Question:please do share your best number email and time to reach youWork Remotely:No",
    "salary": "\n$30 - $35 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_edaf9b06ebab7aa1",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Video Specialist",
    "company_name": "Toast",
    "location": "Boston, MA 02215 (Kenmore area)",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=edaf9b06ebab7aa1",
    "summary": "Video Specialist - Customer Education\n\nNow, more than ever, the Toast team is committed to our customers. We're taking steps to help restaurants navigate these unprecedented times with technology, resources, and community. Our focus is on building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love. And because our technology is purpose-built for restaurants, by restaurant people, restaurants can trust that we'll deliver on their needs for today while investing in experiences that will power their restaurant of the future.\n\nBready* to make a change?\n\n\nAt Toast, we put our customers first. There is already a lot for members of the restaurant community to know, so when they have a question about Toast, we want them to be able to find the answer FAST! In the Video Specialist role, you'll be expected to know the Toast product, know the Toast customers, and develop a video strategy to help keep them informed.\n\nAbout this roll* (Responsibilities)\n\nWrite, edit and publish self-help articles onto Toast Central\nAudit and update existing video content in our video library based on product updates\nCreate new scripts and shoot as much in house content as possible for new educational video needs\nMeet with cross-functional partners to validate and scope where new video content is needed\nProject manage content calendar for video updates and releases\nHandle the admin elements of running Toast Classroom videos. This includes securing host, managing schedules for back-ups, scheduling chat owners, and analyzing impact data\nDevelop resources for customers post-training based on trends within questions of Toast Classroom sessions\nPilot and host weekly live workshop sessions to support self-install customers complete Go-Lives faster.\nScope and maintain a new certification tool to help rebuild Toast University\n\nDo you have the right ingredients*? (Requirements)\n\nStrong writing skills, with the ability to convert complex topics into simple steps\nStrong organizational skills\nSelf-motivated\nUnderstanding of restaurant operations and workflows\nPrevious experience with Toast product is a plus but not required.\nExperience with video editing software\n\nBread puns encouraged but not required",
    "salary": "NOT_FOUND",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_950a53dca996f8e8",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Wastewater Treatment Plant Superintendent",
    "company_name": "Town of South Hadley",
    "location": "South Hadley, MA 01075",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=950a53dca996f8e8",
    "summary": "The Town of South Hadley is seeking applicants for the position of full time Wastewater Treatment Plant Supervisor for the WWTP and 4 pumping stations. This individual will be responsible for directing all operations concerned with the treatment, maintenance, operation and administration of plant functions and personnel.(Must apply through www.southhadley.org\/jobs to be considered.)The successful candidate will have thorough knowledge of equipment, facilities, materials, methods and procedures used in water treatment systems; considerable knowledge of water treatment plant operation and maintenance. Skill in operation of the listed tools and equipment. Ability to interpret specific chemical and biological analyses; ability to guide, direct and motivate employees; ability to plan, organize and supervise the activities of work crew performing construction and maintenance work. Ability to communicate effectively, verbally and in writing; intermediate office skills, ability to establish and maintain effective working relationships with employees, other departments and the public.The candidate will need to be proficient in the operations and maintenance of a wastewater treatment plant and pumping stations, in order to meet Environmental Protection Agency (EPA) and Massachusetts General Law requirements. Prepares for DEP and EPA requirements, all written annual reports and inspections on sludge, alarms, inspections of pumping stations, staffing, sewer collection systems, and nitrogen removal.Assigns daily work, plans, schedules and implements construction, maintenance, and operation and construction activities designed to provide quality wastewater treatment for the town; oversees construction and maintenance work to determine acceptability and conformance to standards.Analyzes and evaluates operation and maintenance functions; initiates and recommends new and improved practices. Coordinates, assigns and directs preparation of data and related reports to meet the requirements of the EPA, MA DEP or other organizations as needed. Coordinates and reviews all relative data related to the treatment plant and pumping stations. Designates essential personnel.Licensure requirements include Massachusetts State Wastewater Treatment Certification Grade VI (6) or VII (7), Grade III (3) Collection System certification preferred as established by the Commonwealth of Massachusetts Board of Certification of Operators of Water Treatment Facilities.Educational & experience requirements include Associate’s Degree in physical, chemical, or biological sciences, or a closely related field; and five (5) years of experience in operating Grade VII (6) or VII (7) water treatment facilities with at least 3 years in a supervisory capacity or any equivalent combination of education and experience.Salary range $64,000 – $70,000 DOE\/DOQ and contingent upon a successful CORI check.To submit an application and view our unabridged job description; please visit our website at: www.southhadley.org\/jobsThis posting will remain active until filled.The Town of South Hadley is an Affirmative Action\/Equal Opportunity Employer.Job Type: Full-timePay: $60,000.00 - $70,000.00 per yearBenefits:Dental insuranceEmployee assistance programFlexible spending accountHealth insuranceLife insurancePaid time offRetirement planVision insuranceSchedule:Monday to FridayWork Location:One locationThis Job Is:A job for which military experienced candidates are encouraged to applyA job for which all ages, including older job seekers, are encouraged to applyCompany's website:www.southhadley.org\/jobsBenefit Conditions:Waiting period may applyWork Remotely:No",
    "salary": "\n$60,000 - $70,000 a year",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "pj_187b8c0741729d36",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Part-time Administrative Assistant($16-$18hr)",
    "company_name": "Schulte Staffing Solutions",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=187b8c0741729d36",
    "summary": "Schulte Staffing Solutions is looking to hire an Administrative Assistant for a growing Oil company, in Lynn, MA.Hours & Pay Rate: Part-Time, Mon-Fri: 10a-4p and 11a-5p in the winterFull-Time work is also being consideredPay Rate: $16-$18\/hr Depending on ExperienceYour Role: General administrative data entryAssist Operating Manager with documentation using QuickBooksBalance multiple phone linesDirect calls to the proper correspondentBackground Profile: Pleasant, professional phone mannerAttention to detailAbility to work independently and with a teamBookkeeping experience a plushttps:\/\/www.schultestaffing.com\/contact-us\/Job Types: Full-time, Part-timePay: $16.00 - $18.00 per hourBenefits:Health insuranceSchedule:Monday to FridayExperience:Data Entry: 1 year (Preferred)Administrative: 1 year (Preferred)QuickBooks: 1 year (Preferred)Work Location:One locationBenefit Conditions:Waiting period may applyOnly full-time employees eligibleWork Remotely:No",
    "salary": "\n$16 - $18 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_0c67bcb7078b8358",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Program Administrator, Graduate Student Families",
    "company_name": "MIT",
    "location": "Cambridge, MA (MIT area)",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=0c67bcb7078b8358",
    "summary": "Working at MIT offers opportunities, an environment, a culture – and benefits – that just aren’t found together anywhere else. If you’re curious, motivated, want to be part of a unique community, and help shape the future – then take a look at this opportunity.\n\nPROGRAM ADMINISTRATOR, GRADUATE STUDENT FAMILIES, Office of Graduate Education (OGE), to serve as the primary point of contact and a central resource for information and support services to graduate students in their role as parents. Will help students connect with programs, policies, and other resources to help improve the experience and alleviate the stressors related to raising a family while being a student. Responsibilities include managing a portfolio of MIT-administered programs for student parents, advising students on relevant policies\/procedures, and delivering services to student parents (e.g., events, workshops, orientations, and other guidance and support); collaborating with other OGE staff and working with academic departments and partners across MIT in coordinating processes\/programs such as childbirth accommodation and parental leave, graduate family portable grants, and community building programs; taking a primary lead on orchestrating some programs for student families and collaborating with Institute partners to offer others; contributing to the overall goals and objectives of the OGE, including support in strategic planning, program assessment, gap analysis, data collection, report generation, and other office- and Institute-wide projects\/initiatives.\n\nJob Requirements\nREQUIRED: at least two years’ administrative and\/or project\/program administration experience; bachelor’s degree; strong organizational, interpersonal, and written and oral communication skills; self-motivation; ability to interact with and\/or collaborate effectively across all levels, including with students, faculty, and administrators; knowledge of and appreciation for cross-cultural and bias issues and demonstrated ability to work with diverse populations; ability to listen carefully and communicate tactfully; experience with databases and proficiency in Microsoft Word, Excel, PowerPoint, and Drupal or an equivalent web application. PREFERRED: master’s degree with emphasis on program coordination, assessment, higher education administration, academic advising, or related field. Job #18910-7\n\nSalary range: $56,597-68,000",
    "salary": "\n$56,597 - $68,000 a year",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_46a0478e60e99d8f",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Underwriting Account Associate",
    "company_name": "Zurich",
    "location": "Boston, MA",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=46a0478e60e99d8f",
    "summary": "200004VN\n\nResponsible for evaluating exposures\/controls, evaluating loss history, assessing financial condition, for basic to moderately complex business.\nClient Internally Focused - The job’s core deliverables rely on delivering service to internal clients, usually at the line manager or employee level. May involve sharing subject matter expertise to others in the organization or supporting others in their efforts to deliver on our promise.\nRequired\nBachelors Degree and No prior experience required in the Administrative or Customer Service or Data Entry or Financial Services or Risk Management area\n\nOR\nHigh School Diploma or Equivalent and 2 or more years of experience in the Administrative or Customer Service or Data Entry or Financial Services or Risk Management area\n\nAND\nSome travel may be required\n\nPreferred\nUnderwriting\/underwriting operations, claims, risk management or premium audit experience\nExperience with data collection and analysis\nExcellent customer service orientation and communication skills\nIn-depth knowledge of processing, rating and policy issuance systems\nDetail oriented\nOrganizational, prioritization, and multi-tasking skills\nMastery of processing, rating and policy issuance systems\nMicrosoft Excel – intermediate. Pivot tables, spreadsheets, Macros\n\nAdditional Information\nImagine working for a company that truly cares about their employees, customers, stakeholders, and communities they serve. Imagine working for a values-driven organization that has the ambition and desire to be the best global insurance provider in the world. Zurich is that place where 55,000 employees across approximately 200 countries and territories are all focused on helping people and helping companies protect what is truly most important to them. We are a values-driven organization that takes pride in the work that we do every day and we have the ambition to be the best global insurer in the world.\nEOE disability\/vets\nZurich does not accept unsolicited resumes from search firms or employment agencies. Any unsolicited resume will become the property of Zurich American Insurance. If you are a preferred vendor, please use our Recruiting Agency Portal for resume submission.\n\nPrimary Location United States-Massachusetts-Boston\n\nSchedule Full-time\n\nTravel Yes, 5 % of the Time\n\nRelocation Available No\n\nJob Posting 08\/25\/20\n\nUnposting Date Ongoing",
    "salary": "NOT_FOUND",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_dfabf901aa4e8600",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Communications Officer",
    "company_name": "MIT",
    "location": "Cambridge, MA (MIT area)",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=dfabf901aa4e8600",
    "summary": "Working at MIT offers opportunities, an environment, a culture – and benefits – that just aren’t found together anywhere else. If you’re curious, motivated, want to be part of a unique community, and help shape the future – then take a look at this opportunity.\n\nCOMMUNICATIONS OFFICER, MIT Sandbox Innovation Fund Program (MIT Sandbox), to serve as a communications and content manager with responsibility for coordinating and creating content for the program and its international sister programs and for marketing, communication, and engagement functions. These responsibilities are critical to Sandbox’s sustainability and growth within the MIT community and internationally as it helps other institutions implement equivalent programs to expand the experience of MIT students (e.g., Explorer program in Morocco). Will lead the execution of Sandbox communication and marketing activities and the creation and implementation of content and materials; develop strategies for outbound marketing and communication in order to deepen and broaden Sandbox relationships; network and influence relationships through Sandbox marketing and group communications with target audiences to achieve communication and marketing objectives; partner with the executive director on communications and materials to the funding board, MIT, and UM6P (Mohammed VI Polytechnic University) senior leadership and to students and mentors; and establish tracking tools for and creates a strategy to update and maintain the Sandbox Websites.\n\nThe MIT Sandbox provides meaningful seed funding of up to $25,000 for student-initiated ideas, mentoring from within MIT and from a broad network of committed partners, and tailored educational experiences.\n\nJob Requirements\n\n\nREQUIRED: bachelor's degree in a related field; at least five years’ communications or marketing experience; ability to work in a team-oriented environment; excellent organizational, execution, interpersonal, presentation, and oral and written communication skills; experience with a CMS; proficiency with standard data management software such as Microsoft Office, G Suite, and SurveyMonkey; and ability to prioritize work in a fast-paced environment. Job #18833-8\nMust be able to work occasional evening and weekend hours.\n\nThis a two-year term position that will be reviewed yearly.",
    "salary": "NOT_FOUND",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_d840002b9f1da862",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Contracts Manager (654)",
    "company_name": "Servicenet Inc.",
    "location": "Northampton, MA",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=d840002b9f1da862",
    "summary": "Contracts ManagerFiscal DepartmentNorthamptonServiceNet, a large non-profit human services agency in Western Massachusetts is seeking a contracts manager to join our fiscal department in Northampton MA. ServiceNet provides a wide spectrum of services to more than 12,000 people in Western Massachusetts; seventy-five percent of our revenue is acquired through Government contracts and grants. Needless to say, this keeps our fiscal department bustling all year long.Full time position available in the Fiscal department of a non-profit human services agency reporting directly to the Controller. .Responsibilities include: Primary responsibility for contract renewals and amendmentsPreparation, approval, and submission of monthly vouchersCoordination of monthly voucher entry for general ledger closeSpreadsheet and database entry, creation, and maintenance.Detailed oriented with excellent ability to analyze data and circumstancesAbility to perform multiple tasks simultaneously, work effectively in a team environment and meet deadlines.Minimum Requirements: Associates degree in accounting, finance or related field or equivalent work in a not-for –profit accounting settingStrong interpersonal and communication skillsProficiency with using ExcelExperience with Commonwealth of Massachusetts EIM system strongly preferredWHAT WE OFFERWe believe in a healthy balance between work and the rest of your life. So in addition to our starting salary of $50,000-$56,000 we offer:· a generous time-off package;· comprehensive, low-deductible health and dental insurance plans;· a 403(B) retirement plan, with employer matching;· Long-term disability benefits; paid life insurance; tuition assistance; and severalINTERESTED?Please email your resume and cover letter, and schedule you are interested in, noting Search #654 in the subject line. We look forward to hearing from you!ServiceNet is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or veteran status. We are proud to be a tobacco-free employer.Job Type: Full-timePay: $50,000.00 - $56,000.00 per yearBenefits:Dental insuranceDisability insuranceHealth insuranceLife insurancePaid time offRetirement planTuition reimbursementEducation:Associate (Required)",
    "salary": "\n$50,000 - $56,000 a year",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "pj_fc5bc2af0d48b5a0",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Relief Receptionist (as needed)",
    "company_name": "St. Mary's Center for Women and Children",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=fc5bc2af0d48b5a0",
    "summary": "St. Mary's Center for Women and Children offers innovative and family-centered programs for women and children who have experienced trauma and are living in poverty. Placing families at the center of our efforts, St. Mary’s Center works in partnership with young women, many of them mothers, to break the intergenerational cycle of poverty and achieve lasting, powerful change by building their emotional well-being, educational achievements and economic independence.We currently have openings for Relief Receptionists to provide as coverage as needed for the front desk. The individual in this role will oversee the central reception area by answering phone calls, greeting visitors, distributing mail, and providing program support, as well as other administrative support as needed.Nature and Scope:These duties are not meant to be all-inclusive and may be adjusted as necessary upon discussion.JOB DUTIESOFFICE DUTIES & ORGANIZATIONAs the face of the organization, the individual in this role will be the first point of in person contact and provide and maintain clear and respectful communication with other staff, clients, families and community partners.Completes all typing, photocopying, collating, filing and general correspondence as requested in an accurate and timely manner.Sorts and distributes the agency mail and handle outgoing forwarded\/return mail daily.Completes all data entry request in a timely manner.Ensures office equipment’s are maintained and in good working condition.Retrieves all program daily census for Reception Handbook via email.Maintains consistent professional, legal and ethical standards in accordance with Federal, State and Agency laws).Knowledgeable and compliant with program specific policies, procedures, rules and regulations.Maintains safety, appearance and cleanliness of the facility in compliance with health, fire and safety regulations.Keeps the front desk in an organized manner.Develops and maintains positive relationships with all customers.Serves as a positive role model following the organization guidelines for professional appearance and behavior.Reviews security alerts.Other duties as assigned.RECEPTIONGreets all visitors and notify staff members of their arrival or direct them to the proper destination.Communicates any security concerns appropriately to the Executive Assistant and leadership team member on-call.Answers telephone, retrieves voicemail and forward incoming calls or take accurate messages if appropriate party is not available.Provides referral information on phone inquiries regarding shelter.Sends outgoing faxes as requested.Accepts packages only for St. Mary’s and direct all other deliveries to tenant partner locations.Accurately schedule meetings and functions in calendar and process paperwork.PROFESSIONAL GROWTH AND DEVELOPMENTAttends applicable workshops and utilizes supervisor’s participation and contribution towards professional growth.Participates in staff meetings and training opportunities.Engages in self-evaluation to establish goals for professional development.JOB REQUIREMENTSHigh School Diploma and formal secretarial training or equivalent combination of experience and training that provides the required knowledge, skills and abilities.At least two years’ basic office management\/secretarial experience.Basic word processing and computer skills using Microsoft Office 365.Other Requirements:Ability to engage in collaborative relationship with multidisciplinary teamPleasant telephone demeanor.Patient, understanding, and supportive to the needs of customers and colleagues.Excellent oral and written communication, interpersonal and customer satisfaction skills.A valid MA driver’s license is preferred. Must undergo a background check, in accordance with local law\/regulations.***Applicants must submit a cover letter to be considered for the position. ***Job Type: Part-timeSchedule:Day shiftMonday to FridayNight shiftOn callWeekendsExperience:Office 365: 2 years (Required)Office: 2 years (Required)Education:High school or equivalent (Required)Shifts:Mid-Day (Preferred)Evening (Preferred)Morning (Preferred)Working Days:Monday (Preferred)Tuesday (Preferred)Wednesday (Preferred)Thursday (Preferred)Friday (Preferred)Saturday (Preferred)Sunday (Preferred)Administrative Duties:Stocking suppliesSorting and sending mailAnswering and routing phone callsGreeting visitorsWork Remotely:No",
    "salary": "NOT_FOUND",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_b86526c0548812af",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Administrative Assistant",
    "company_name": "Krazy Kustoms",
    "location": "Wilmington, MA 01887",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=b86526c0548812af",
    "summary": "Krazy Kustoms Inc., a small custom painting and prototyping company located in Wilmington MA is currently seeking an administrative assistant. This is a part time position with growth into a full time position.This is not a remote position and will require physical attendance in our facility.Hours of employment are 8:30am to 2:00pm, Monday through Friday.The office is not open to the general public and is by appointment only.Requirements to be considered for this position include:-Experience working on a Mac platform with Outlook-Comfortable interacting with customers on the telephone-Upbeat, cheerful personality-Excellent attention to detail-Organized self-starter-Experience with Quickbooks Pro-Can speak and write English-Must be able to pass a Massachusetts CORI background checkThere is no technical knowledge required for this industry, but familiarity with an autobody or mechanical business is helpful.Duties for this position include but are not limited to:-Answering the telephone, taking messages and setting up appointments with clients and vendors via email and phone.-General office duties: printing, scanning, filing etc.-Data entry into Quickbooks Pro-Bookkeeping responsibilities including payroll, accounts payable and receivablePlease visit our company website to learn about what we dowww.krazykustoms.netNo phone calls will be accepted about this position.No recruitersPlease forward a resume with salary requirements for consideration.Job Type: Part-timePay: $16.00 - $22.00 per hourSchedule:Day shiftMonday to FridayCOVID-19 considerations:In order to keep our facility as safe as possible, no customers or vendors are allowing in the building without an appointment. Masks and sanitizers are provided upon request. The building does not have more than 5 employees at one time.Experience:QuickBooks: 4 years (Required)Education:High school or equivalent (Required)Location:Wilmington, MA 01887 (Required)Language:English (Required)Shifts:Morning (Required)Working Days:Monday (Required)Tuesday (Required)Wednesday (Required)Thursday (Required)Friday (Required)Setting:OtherFinancial Duties:Expense reportsProcessing paymentsBillingPayrollPurchasingThis Job Is:A job for which military experienced candidates are encouraged to applyOpen to applicants who do not have a college diplomaCompany's website:www.krazykustoms.netWork Remotely:No",
    "salary": "\n$16 - $22 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_b8cbefdbea545f35",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Safelink Relief Advocate",
    "company_name": "Casa Myrna",
    "location": "Boston, MA 02121 (Roxbury area)",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=b8cbefdbea545f35",
    "summary": "Casa Myrna is Greater Boston’s foremost provider of solutions to end domestic and dating violence. The agency operates three residential programs in Boston for survivors and children made homeless by domestic violence, a comprehensive range of advocacy and supportive services, and SafeLink, Massachusetts’ statewide 24\/7 toll-free domestic violence hotline. In addition, Casa Myrna works to end domestic and dating violence through education, awareness and prevention.Principal Duties and Responsibilities Ascertains callers’ needs and provides crisis intervention by: conducting safety assessment and safety planning, supportive listening, providing callers with information on and about domestic violence and its dynamics, and connecting callers to all appropriate resources.Accesses the on-line Bed Update in order to provide up-to-date shelter availability information for all callers seeking emergency shelter or safe home placement.Utilizes all resources to provide every caller with options for a safe place to stay for at least one night.Facilitates access to community and residential services by directly linking callers to those services state and nation-wide.Exhibits positive teamwork by collaborating with SafeLink staff on difficult calls, answering hotline calls when colleagues are busy or engaged in other work, and demonstrates behavior that is open to feedback and suggestions.Keeps abreast of domestic violence services and resources in order to deliver high quality service to callers. This includes attending monthly staff meetings, trainings and individual supervision meetings.Logs every call into SafeLink’s database to ensure accurate and complete collection of data.Exhibits excellent customer service skills when interacting with callers, staff, and external constituents. This includes remaining professional, empathetic and courteous.Adheres to Casa Myrna’s and SafeLink’s policies and procedures while performing day-to-day activities to ensure successful operation within the department and agency.Other duties as assigned by the supervisor.Qualifications and Requirements Bachelor’s degree or 3 years’ experience providing direct service in a human services organization, which includes a minimum of one year experience working in a community organization or social service organization doing crisis intervention, counseling, advocacy or hotline work.Excellent communication and crisis-management skills.Demonstrated ability to utilize appropriate communication techniques when responding to callers that shows sensitivity to the caller’s needs.Ability to interact with callers in a non-judgmental manner.Ability to work independently and as part of a team.Familiarity with statewide agencies and resources for homeless and at-risk populationsMust be able to work with diverse cultural and socio-economic backgrounds.Strong organizational skillsMaintains professional boundaries at all timesMaintains confidentiality regarding callersGood computer skills.Bi-lingual English\/Spanish preferred.Ability to work evenings, weekends and occasional overnights.Hourly rate: $15.75 hourlyLocation:  Boston AreaAvailable shifts: Sundays 12:45pm-10pmFridays 6pm-10pmSaturdays: 7:45am-5pmCasa Myrna is an equal opportunity employer committed to workforce diversity and hiring people with diverse life experiences. Survivors, people who are bilingual\/bicultural, persons of color, people with disabilities and LGBQ\/T people are strongly encouraged to apply.Job Type: Part-timeSchedule:Night shiftWeekendsCOVID-19 considerations:To keep our Safelink Relief Advocates safe, all shifts are conducted remotely. In non COVID times, weekends and evening shifts are normally conducted remotely.Experience:providing direct service work: 3 years (Required)familiarity with statewide agencies and resources: 2 years (Required)working with volunerable population: 2 years (Required)Language:Spanish (Preferred)Work authorization:United States (Preferred)Company's website:www.casamyrna.orgWork Remotely:Yes",
    "salary": "\n$15.75 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_ce920e6550e2e0e2",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Data Engineer",
    "company_name": "Altair Engineering",
    "location": "Bedford, MA",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=ce920e6550e2e0e2",
    "summary": "Transforming the Future with the Convergence of Simulation and Data\n\n\nData Engineer\n\nDo you like a challenge, are you a complex thinker who likes to solve problems? If so, then you might be the new Altairian we are searching for. At Altair, your curiosity matters. We pride ourselves on a business culture that enables open, creative thinking, and we deeply value our employees and their contributions towards our clients' success, as well as our own.\nJob Summary:\n\nAltair Data Analytics solutions empowers individuals, teams, and entire organizations to evolve and expand the use of data for both operational efficiencies and analytical insights. Our market-leading products support self-service analytics, predictive analytics, and streaming analytics across a wide variety of industries and use cases.\n\nAltair is looking for a highly motivated and energetic Data Engineer to join the Knowledge Works Professional Services team. We are looking for those with the ability to navigate and adapt in a fast-paced environment and help implement and integrate our new product into varied environments. A candidate for this position should be comfortable working in both on-premise as well as cloud environments; however, of the two, cloud experience is preferred.\n\n\nWhat You Will Do:\n\nProvide support to Altair Knowledge Works products like Monarch Server, Knowledge Hub, Knowledge Studio a comprehensive software platform that allows end users to perform in-depth analysis on their data while injecting predictive and complex statistics in the analysis.\nManage and deliver Data Engineering activities ranging from installation through project management and delivery.\nIdentify and solve technical and\/or software issues, define system architecture, and analyze and implement hardware\/software specifications.\nImplement, test and provide guidance on solution deployments.\nWork with team members and managers to monitor the overall quality and timeliness of project delivery.\nGather requirements and provide effort estimates for delivering Altair Knowledge Works solutions\n\n\nWhat You Will Need:\n\nBasics:\n\n3+ years of experience identifying and solving technical and\/or software issues, defining system architecture, and analyzing and implementing hardware\/software specifications.\n2+ years of experience in the field of Data Engineering\nBachelor's degree or equivalent in Information Systems, Engineering, Computer Science or related field\nAbility to travel on a project basis to client locations\nGood Linux system administrator skills and TCP\/IP network fundamentals\nExperience with Cloud Computing technologies like AWS\/Azure\/GCP and\/or Docker\/Kubernetes\nAbility to produce clear, detailed project scoping and design documentation to be used by technical specialists to build appropriate solutions for Altair Knowledge Works customers\nWell versed in generic administration tasks of managing Docker images, container networking and standard infrastructure maintenance tasks on Docker and Kubernetes platform\nBuilt and managed a container orchestration platform from the ground up\nExperience with managing Docker Swarm\nExperience in managing a large K8S cluster and scaling it significantly at enterprise scale\nExperience with monitoring tools such as Grafana, and Kibana\nWorking experience\/conceptual knowledge in BI\/DWH\/ETL concepts and tools\nProfessional Services and client facing experience\nExcellent communication skills, both written and oral\n\n\nHow You Will Be Successful:\n\nEnvision the Future\nCommunicate Honestly and Broadly\nSeek Technology and Business “Firsts”\nEmbrace Diversity and Take Risks\n\n\nWhat We Offer:\nCompetitive Salary\nComprehensive Benefit Package\nOutstanding Work\/Life Balance\nFlex Time\nPaid Time Off and exceptional number of paid holidays\nPaid Time Off for Community Service\nCollaborative environment\nCharitable Matching Program\n\n\nWhy Work with Us:\n\nAltair is a global technology company that provides software and cloud solutions in the areas of product development, high performance computing (HPC) and data analytics. Altair enables organizations in nearly every industry to compete more effectively in a connected world, while creating a more sustainable future. With more than 3,000 engineers, scientists and creative thinkers in 25 countries, we help solve our customer’s toughest challenges and deliver unparalleled service, helping the innovators innovate, drive better decisions, and turn today’s problems into tomorrow’s opportunities.\n\n\nOur vision is to transform customer decision making with simulation, data analytics, and high-performance computing.\n\n\nFor more than 30 years, we have been helping our customers integrate electronics and controls with mechanical design to expand product value, develop AI, simulation and data-driven digital twins to drive better decisions, and deliver advanced HPC and cloud solutions to support unlimited idea exploration. To learn more, please visit altair.com.\nReady to go? #ONLYFORWARD",
    "salary": "NOT_FOUND",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "pj_511726a70f6d94f1",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "General Cleaner",
    "company_name": "FM&M Inc.",
    "location": "NOT_FOUND",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=511726a70f6d94f1",
    "summary": "We are looking for a Cleaner to take care of our facilities and carry out cleaning and maintenance duties. The goal is to keep our building in a clean and orderly condition.ResponsibilitiesClean, stock and supply designated facility areas (dusting, sweeping, vacuuming, mopping, cleaning ceiling vents, restroom cleaning etc)Perform and document routine inspection and maintenance activitiesCarry out heavy cleansing tasks and special projectsNotify management of occurring deficiencies or needs for repairsMake adjustments and minor repairsStock and maintain supply roomsCooperate with the rest of the staffFollow all health and safety regulationsSkillsProven working experience as a cleanerAbility to handle heavy equipment and machineryKnowledge of cleaning chemicals and suppliesFamiliarity with Material Safety Data SheetsIntegrityHigh school degreeJob Type: Part-timePay: $14.14 per hourSchedule:Monday to FridayExperience:janitorial: 2 years (Required)cleaning: 2 years (Required)Language:Spanish (Preferred)Work authorization:United States (Required)Hours per week:20-29Typical start time:4PMTypical end time:9PMCleaning Equipment:Floor bufferFloor waxerFloor stripperFloor burnisherPay Frequency:WeeklyThis Job Is:A job for which military experienced candidates are encouraged to applyWork Remotely:No",
    "salary": "\n$14.14 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_8475032f6c7211ab",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Front Desk Attendant",
    "company_name": "Ramada Hotel and Comfort Inn",
    "location": "Boston, MA 02122 (South Dorchester area)",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=8475032f6c7211ab",
    "summary": "FRONT DESK ATTENDANTThe Ramada and Comfort Hotels have an immediate opening for Front Desk Attendants to join our Team.We are looking for Front Desk Agents to serve as our guests’ first point of contact and manage all aspects of their accommodation. Front Desk Agent responsibilities include registering guests, managing reservations and providing information about rooms, rates and amenities.If you have a knack for customer service and work experience in the hotel industry, we’d like to meet you. Ultimately, you will help create a pleasant and memorable stay for our guests.Responsibilities include:Perform all check-in and check-out tasksManage online and phone reservationsInform customers about payment methods and verify their credit card dataRegister guests collecting necessary information (like contact details and exact dates of their stay)Welcome guests upon their arrival and assign roomsProvide information about our hotel, available rooms, rates and amenitiesRespond to clients’ complaints in a timely and professional mannerLiaise with our housekeeping staff to ensure all rooms are clean, tidy and fully-furnished to accommodate guests’ needsMaintain updated records of bookings and paymentsRequirementsWork experience as a Hotel Front Desk Agent, Receptionist or similar roleExperience with hotel reservations software, like OPERA and\/or CHOICEUnderstanding of how travel planning websites operate, like Booking and TripAdvisorCustomer service attitudeExcellent communication and organizational skillsWe are an Equal Opportunity Employer EEOJob Type: Full-timePay: $13.00 - $14.00 per hourBenefits:401(k)Dental insuranceHealth insurancePaid time offSchedule:8 hour shiftDay shiftHolidaysMonday to FridayWeekendsCOVID-19 considerations:To keep our Front Desk Attendants as safe as possible we have installed clear plastic barriers and provide masks, gloves and hand sanitizer.Education:High school or equivalent (Preferred)Communication method(s) used:PhoneIn personBenefit Conditions:Waiting period may applyWork Remotely:No",
    "salary": "\n$13 - $14 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_527e51f0d3ffe7b4",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Part-Time Regulatory Associate",
    "company_name": "MilliporeSigma",
    "location": "Taunton, MA 02780",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=527e51f0d3ffe7b4",
    "summary": "Part-Time Regulatory AssociateMilliporeSigma-Taunton, MA20 hours per week.DURATION: ASAP-1 year possible (extension or conversion to FTE)Your role: As a Dangerous Goods regulatory expert in the Global Hazard Communication function of the Life Science business sector, you are responsible for tracking and understanding regulatory requirements, implementing systems, data, and processes to support transport regulations with regard to Merck’s broad global Life Science product portfolio as well as further optimizing, streamlining and automating the global DG processes with regards to compliance and efficiency. The basic framework is constituted by the SAP module EHSM as the central data repository of substance data and RID\/ADR, IMO, IATA classifications. In a global team, in day-to-day business or in global projects you assess dangerous goods classifications and determine packaging and transport restrictions as well as working with cross functional teams to develop compliant solutions that fulfill the business needs.Who you areSound knowledge of UN regulations concerning dangerous goods transport and professional expertise in DG transportation requirements (DOT, RID\/ADR, IATA, IMO, PK1 certification).Capable of monitoring compliance of dangerous goods shipments – completed and in process – and of advising site personnel where corrections are needed.Willing to follow all site safety protocols and wearing of PPE. * Comfortable working in a warehouse environment and directing daily shipment modification as needed.Confidant in enforcing compliance with both internal and external parties.Experienced in providing employee training.Knowledgeable of shipment exceptions and how to apply these when necessary.Able to apply NFPA, other local EHS and fire codes as related to hazardous material storage.Able to function as a liaison for senior team members in the event of a government inspection and to help facilitate site inspections.Capable of directing follow-up on citations and taking any necessary corrective actions.Able to conduct internal audits of site activities and procedures and to prepare reports of findings.Willing to travel for offsite department meetings\/workshops as needed.Strong project management and communication skills; willingness to work cooperatively within a global team.Team spirit, outstanding initiative, reliability and accuracy.Excellent English skills; German a plus.Experience with SAP EHSM, Oracle, knowledge of Microsoft Excel and Access is strongly preferred.EDUCATION: Bachelor's degree in Chemistry, science major and 1 to 3 years experience.MilliporeSigma is an Equal Employment Opportunity employer. No employee or applicant for employment will be discriminated against on the basis of race, color, religion, age, sex, sexual orientation, national origin, ancestry, disability, military or veteran status, genetic information, gender identity, transgender status, marital status, or any other classification protected by applicable federal, state, or local law. This policy of Equal Employment Opportunity applies to all policies and programs relating to recruitment and hiring, promotion, compensation, benefits, discipline, termination, and all other terms and conditions of employment. Any applicant or employee who believes they have been discriminated against by the Company or anyone acting on behalf of the Company must report any concerns to his\/her Human Resources Business Partner, Legal, or Compliance immediately. The Company will not retaliate against any individual because he\/she made a good faith report of discriminationJob Types: Part-time, ContractSchedule:Day shiftMonday to FridayExperience:Compliance Monitoring and Auditing: 3 years (Required)Dangerous good transport: 2 years (Required)Regulatory Compliance: 2 years (Required)Education:Bachelor's (Required)Location:Taunton, MA 02780 (Required)Work authorization:United States (Required)Full Time Opportunity:YesWork Location:One locationWork Remotely:No",
    "salary": "NOT_FOUND",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}, {
    "unique_id": "p_ca0b29255126a5c0",
    "city": "Massachusetts",
    "job_qry": "data",
    "job_title": "Office Assistant",
    "company_name": "Terranova & Associates, LLC",
    "location": "Danvers, MA 01923",
    "link": "https:\/\/www.indeed.com\/viewjob?jk=ca0b29255126a5c0",
    "summary": "20-25 hours per week; flexible hoursDutiesMeet and greet visitorsAnswer multi-line telephone system, address and\/or forward calls as per protocolSchedule appointmentsUsing our accounting\/payroll softwareCollect and distribute mailRun errands out of office, such as restocking supplies, post office and bank, as neededPrepare outgoing mailScan and file documents as per protocolData process on QuickBooksResponsible for office supplies inventory: keeping track of inventory levels, ordering additional supplies, receiving supplies, and organizing and put away suppliesResponsible for keeping front lobby clean, neat, organized as per protocolContributes to team effort by accomplishing related results as neededAssist office manager, professional staff as neededSkillsMicrosoft suite of products: Word, Excel, Outlook* - requiredHandle multi- line phone system - requiredAdobe Professional - requiredExperience with QuickBooks, Prosystem fx Tax a plusComfortable using computerKnowledge of accounting processing software, analyzing information, data entry skills, detail oriented, maintain confidentiality, thoroughness, general math skills, reporting skills, verbal communication, and organization.Ideal individual: Motivated, optimistic, energetic individual with a “can-do” attitude, able to maintain a professional and cheerful manner, problem solver.Job Types: Full-time, Part-timePay: $15.00 - $18.00 per hourSchedule:Monday to FridayWeekendsExperience:office assistant: 1 year (Preferred)10 Key: 1 year (Preferred)QuickBooks: 1 year (Preferred)Location:Danvers, MA 01923 (Preferred)",
    "salary": "\n$15 - $18 an hour",
    "date": "Just posted",
    "full_text": "NOT_FOUND"
}]