[{
    "unique_id": "p_417dd9efc9b03318",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Reception Coordinator",
    "company_name": "Valley Medical Group",
    "location": "Amherst, MA 01002",
    "summary": "NOT_FOUND",
    "salary": "Valley Medical Group\n\n\n\n3.0",
    "link": "\/rc\/clk?jk=417dd9efc9b03318&fccid=239749c5ec17349f&vjs=3",
    "date": "1 day ago",
    "full_text": "Thank you for exploring a career with Valley Medical Group! We are a provider-owned, multi-specialty group caring for more than 60,000 patients at four locations throughout the Pioneer Valley.\nValley Medical Group is seeking a Reception Coordinator for our Amherst Health Center!\nPosition: Reception Coordinator\nLocation: Amherst, MA\nHours: Generally 8:00am to 5:00pm, but hours vary as this position supports Reception staff that work hours ranging from 7:00am to 6:00pm. This position also helps to support weekend urgent call shifts.\nResponsibilities: Reporting directly to the Health Center Manager the Reception Coordinator supervises and oversees the daily operations of the Reception department in assigned health center and directly supervises the reception staff. The reception coordinator works closely and in collaboration with all Health Center departments, the Practitioner staff, and Health Center Manager.\nThe Reception Coordinator leads the efforts with staff to adhere to established policies, procedures and standardized processes for the delivery of all reception functions. The Reception Coordinator also ensures compliance with regulatory requirements for the exchange of Health Information, including HIPAA and Confidentiality laws and monitors the performance of reception functions utilizing data and established benchmarks, identifying opportunities for improvement and working with their manager, plans and implements improvements.\nQualifications:\nAssociate’s degree in health or business administration (or equivalent experience) required.\nSupervisory experience required, health care preferred.\n3 - 5 years of experience in a providing medical support services.\nSkills:\nStrong knowledge of reception, scheduling, and phone operations.\nExperience effectively leading staff in a department.\nStrong interpersonal and relationship skills with patients, practitioners, colleagues, and community served.\nStrong communication skills, including written correspondence.\nAbility to prioritize work and meet established deadlines.\nValley Medical Group offers:\nCompetitive Pay with company growth opportunities\nMedical, Dental & Vision Plans\nHealth Savings Account & Healthcare Reimbursement Accounts\nCompany-paid short-term & long- term disability insurance\nCompany-paid life insurance\nWork\/life balance by Paid Time Off (holidays, vacation, sick time)\nCompany Wellness Program\nCome join our team!!"
}, {
    "unique_id": "p_84a8d28b017bea2c",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Baker",
    "company_name": "Patisserie Lenox Inc.",
    "location": "Northampton, MA 01060",
    "summary": "NOT_FOUND",
    "salary": "Patisserie Lenox Inc.\n\n\n\n4.7",
    "link": "\/rc\/clk?jk=84a8d28b017bea2c&fccid=00167c9a9084ebb2&vjs=3",
    "date": "1 day ago",
    "full_text": "Patisserie Lenox Inc. in Northampton, MA is looking for one baker\/short cook to join our 10 person strong team. We are located on 48 Main St. Our ideal candidate is attentive, ambitious, and engaged.\n\nResponsibilities\n\n\nSome baking work in the morning and more of a cook\/short cook responsibilities for the rest of the shift *Weigh and measure ingredients (involves heavy lifting) *Mix and blend batters *Roll, knead, cut, or shape dough *Set oven temperatures and monitor or modify as needed *Ice, glaze, and decorate baked goods *Make soups and do minor kitchen preparations *Make breakfasts, sandwiches and salads to order * Prepare and maintain inventory *Clean and sanitize workstation and equipment\n\nQualifications\n\n\nAttention to detail in all aspects of baking and cooking *Dedicated to working as a team towards one goal (weekends and holidays a must) *Experience as a Baker a plus; experience in a commercial kitchen a must\n\nWe are looking forward to receiving your application. Thank you.\n\nAvailable shifts and compensation: We have available shifts all days of the week. Compensation depends on your experience.\n\nAbout Patisserie Lenox Inc.: an authentic French pastry shop and cafe with four bustling locations: Lenox, Great Barrington, and Northampton, Massachusetts, and Hudson, New York. Among their offerings are artisanal desserts and pastries, including delicious mousse cakes, luscious fruit tarts, as well as croissants and brioches, baked daily. Take a step into one of their lovely patisseries and be dazzled by an overwhelming array of French special occasion cakes and the wide assortment of handmade classic French macarons. Patisserie Lenox also offers an outstanding selection of gourmet coffees, teas and seasonal drinks, as well as homemade ice cream in select locations. They serve classic French breakfast and lunch made with organic ingredients.We invite you to visit us to indulge your senses and experience their products firsthand. Learn more about us at www.patisserielenox.com.\n\nBy applying to this job, you agree to receive periodic text messages from this employer and Homebase about your pending job application. Opt out anytime. Msg & data rates may apply.\n\nPowered by Homebase. Free employee scheduling, time clock and hiring tools."
}, {
    "unique_id": "pj_166a3462632370d9",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Cloud DevOps Strategy Consultant",
    "company_name": "ALINEDS",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "ALINEDS",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0C_1NrteVyrMyXYoxCe5WWiRKjNLWKR-hFQ-kALfKhC_y8PUzrAaRxZA5pRZ7ufArtSvdTK1FGjFYk0csw6o6s1-vRLl8Kncsf-ccjAlR1yO6HpvxrrbxGNOl0D2k3XD9YyWHB6jGbH0CuaGIGZHLYonWJNa2vziVMgjsRJHu83AuqaCa0JV7zROmNizCi7aHTjdcmN5c1sGcSwVFe-GjpXi_tvllvFY4ivD0NhjcskyLFq8NYVpjIi1sNJX970PcCq3qJoL1zct3MpyUT4AIk2BDOBikyxeQ9anbbkpw57PvYi9atyz-N_M6YBSiQnitoyX21LQtk8EVD1rYi7uRkrJxYmf5tKazQHyT5V3PvEhLYCHnRGNx4_vb-aHAWUHZX6Kj87_Y0K2IGSG63Hy9Hg87CB_quk7j_04eS_dx1Re6hIkskBoqizoQj5P-U2FYI=&p=2&fvj=1&vjs=3",
    "date": "1 day ago",
    "full_text": "Specific Project RequirementDevelop an actionable Cloud DevOps Strategy and Roadmap that aims to enable the ability to baseline, measure and demonstrate value throughout the stages of implementing change and pivoting to an optimized cloud operating model and service consumption model.Must be Proficient in Microsoft PowerPoint, Excel & WordWhat you will doUse existing data sources and interviews with key technology and project stakeholders to build a summary of the current technology landscape and potential strategies already in flight.Assist client with the development of business cases and value realization plans for the deployment of cloud-based services.Identify changes to existing service management processes.Develop DevOps Maturity Target recommendationsDevelop DevOps Framework with a clear definition of the proposed Organization structure, processes, skills uplift, and responsibilities required to support DevOps.Develop target DevOps architecture & tooling.Develop the Cloud DevOps Roadmap and Measurement Framework which includes “Actionable” Implementation plan to execute the defined DevOps strategy.Identity Cloud DevOps Roadmap Implementation ChallengesQualification & Experience7+ years of relevant consulting or industry experience, with proven ability to build relationships with senior business and technology leaders5+ years of experience in Cloud DevOps solutions Strategy and Implementation for Enterprise organizations (this includes private\/public Clouds – on AWS, Azure, GCP, Alicloud, or VMWare)5+ years of experience in developing business case and TCO analysis drawing tangible connections between cloud DevOps strategy and business-valued financial-success metrics5+ years of experience in quantifying the business value of DevOps and evaluating the organizational impact of cloud adoptionRelevant experience in leading reviews of clients’ technology landscapes to identify a range of business-valued DevOps uses cases.Experience in defining business solutions (enabled by cloud) in Government AgenciesExperience working with a global team (time zone, geographical location) and multi-cultural environment.Strong written and oral communication skills with both technical and non-technical team members and stakeholders. Strong experience presenting to executive sponsors and stakeholders.Job Type: ContractPay: $70.00 - $90.00 per hourSchedule:Monday to FridayExperience:Cloud DevOps Strategy: 5 years (Required)Contract Length:3 - 4 monthsWork Location:Fully RemoteThis Job Is Ideal for Someone Who Is:Detail-oriented -- would rather focus on the details of work than the bigger pictureAutonomous\/Independent -- enjoys working with little directionCompany's website:www.alineds.comWork Remotely:Yes"
}, {
    "unique_id": "pj_52e644a950b664de",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Oracle ASCP Consultant for EBS",
    "company_name": "iAppSys",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "iAppSys",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0DcYPi0Gm6dl7GdujfKqAxLIAuHtpmZ9lZXW2bLiEYcU-i3sJCVLtY9U3O1I9aZua8NrYQnnuzRgSPTCHSVcLnAErOZe2prEL9IUfaRWBmjPN3qdi3UL4es95sEdpLiI82BGDITB2RcxSouPhpTSH5af0PW7lGkCvnyruu-jXjZ1K_flbVuv-HD0pRnnGdcoAT3dwzATu2bmWfktcqfXtpcc_L0kVbDH7TY7xoUlPXjBE1C1hRxXtPZMSX3vMVRUjVJLo0inOmXCBHMHuNMe_Zzsoskkreri4iOLUtqIzd7MqgpQrkmh0FL9VANFeqGr9YXd-qCgayAdtX_ZMHGGrH-CLhY3IaYfCftjrbzfEeakOpCXXSmZPlXCQW3dLs61TWCZyT6UKGvA2a9_kUc7vKrCc0oquG-cMby3ZPVsMRi15SmnzPkFcn40_2NcgZjnfw=&p=3&fvj=1&vjs=3",
    "date": "1 day ago",
    "full_text": "ResponsibilitiesFunctional Skills : The candidate should have strong Functional Knowledge of Oracle Advanced Supply chain Plan & VCP Modules. Candidate should have knowledge on Oracle 11i or R12 Advanced supply chain &Collaborative planning, GOP (Global Order promising) concepts. Should know how to configure planning & source instance set up, and data collections in a distributed planning environment. Should have the Business acumen in understanding the Business problems and Requirement and translate it into Oracle Application for mapping with constrained and un constrained planning. Experience Required : Experience in Oracle Application Functional Advanced supply chain modules. Should know architecture and design the solution as per business problems and requirement. Roles & Responsibilities : Should be able to handle following independently : Production Support Business User clarification Functional Design Document preparation for customization Facilitating the Technical Team in design clarification and development Set ups required Data Migration activities, if any Generic Managerial Skills : As the requirement needs extensive customer interaction following skills would be required: Excellent communication skill (verbal and writing) Strong analytical ability Excellent Organization and Planning capability Education : Bachelors Degree, Masters Degree in Management would be added advantageResponsible for maintaining quality data by performing operations such as cleaning, transformation and ensuring Integrity in a relational environmentExperience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvementAssist in the design, development and maintenance scripts for existing and new data sources utilizing various integration technologiesAdvanced working SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databasesExperience supporting and working with cross-functional teams in a dynamic environmentCollaborate with ETL developers and IT team members to meet business requirementsWorks well under times of intense pressure and adheres to tight deadlines and able to prioritize requests and multi-task with minimal supervisionStrong analytical and problem-solving skills with the ability to solve data related problems and integration with systems such as IP.21, Wellview, and GGRE data sources.Recommend ways to improve data reliability, efficiency and quality while ensuring systems meet business requirements and company best practicesAbility to work independently as well as in a team settingBasics\/Required: 3 years in IT3+ years SQL knowledge to include querying and performance tuning3+ years of experience with PL\/SQL and Oracle1+ years of experience with programming practicesJob Types: Part-time, ContractPay: $900.00 - $12,000.00 per monthSchedule:Monday to FridaySupplemental Pay:Bonus PayEducation:PreferredLanguage:English (Required)Hours per week:30-39This Company Describes Its Culture as:Detail-oriented -- quality and precision-focusedInnovative -- innovative and risk-takingAggressive -- competitive and growth-orientedOutcome-oriented -- results-focused with strong performance cultureStable -- traditional, stable, strong processesPeople-oriented -- supportive and fairness-focusedTeam-oriented -- cooperative and collaborativeCompany's website:www.iappsys.com"
}, {
    "unique_id": "p_f70b9230906b83b3",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Short Order Cook",
    "company_name": "Patisserie Lenox Inc.",
    "location": "Northampton, MA 01060",
    "summary": "NOT_FOUND",
    "salary": "Patisserie Lenox Inc.\n\n\n\n4.7",
    "link": "\/rc\/clk?jk=f70b9230906b83b3&fccid=00167c9a9084ebb2&vjs=3",
    "date": "1 day ago",
    "full_text": "Patisserie Lenox Inc. in Northampton , MA is looking for one short order cook to join our 8 person strong team. We are located on 48 Main St. Our ideal candidate is attentive, punctual, and engaged.\n\nResponsibilities\n\n\nPrepare food orders quickly and accurately (busy breakfast and lunch service) *Keep work areas, counters and equipment clean *Perform from scratch food preparation tasks as needed (soups, sauces etc.) *Keep inventory of produce and place orders with suppliers\n\nQualifications\n\n\nPrevious commercial kitchen experience is a must *Strong time-management skills; ability to multi-task, prioritize, and organize *Knowledge of all health and safety regulations pertaining to food *Ability to receive produce delivery and lift heavy boxes if needed\n\nWe are looking forward to hearing from you.\n\nAvailable shifts and compensation: We have available shifts all days of the week. Compensation depends on your experience.\n\nAbout Patisserie Lenox Inc.: an authentic French pastry shop and cafe with four bustling locations: Lenox, Great Barrington, and Northampton, Massachusetts, and Hudson, New York. Among their offerings are artisanal desserts and pastries, including delicious mousse cakes, luscious fruit tarts, as well as croissants and brioches, baked daily. Take a step into one of their lovely patisseries and be dazzled by an overwhelming array of French special occasion cakes and the wide assortment of handmade classic French macarons. Patisserie Lenox also offers an outstanding selection of gourmet coffees, teas and seasonal drinks, as well as homemade ice cream in select locations. They serve classic French breakfast and lunch made with organic ingredients.We invite you to visit us to indulge your senses and experience their products firsthand. Learn more about us at www.patisserielenox.com.\n\nBy applying to this job, you agree to receive periodic text messages from this employer and Homebase about your pending job application. Opt out anytime. Msg & data rates may apply.\n\nPowered by Homebase. Free employee scheduling, time clock and hiring tools."
}, {
    "unique_id": "pj_5226cd0ab90e0068",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Food Pantry Coordinator: Sourcing & Operations",
    "company_name": "Amherst Survival Center",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Amherst Survival Center",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0CyoL2YPxrGNb8arIjAbJDuvqpZCxeDBI3n_N-b6fEGgzChSRyWtiTIdFrGAmwmdHWdKAcY_bPIG0G6mkLVGpX1w6-SwGfiSPMuPK43g214lhAp6OY8jFsoEmwn6KrPkFCXJWTXo_CLLU-TGjFTG07Kt0nbrD-25ssjYR4WbpRE2a5yOhJOQhYeFeac9dRYm8kvaf99qDw9rnPfGJoQxBtSHgped3_7v4iuNw_1e8NlMPrx1rmLApNe3rB_fvc6Pqm8SAYtYYfnqX5vIt0AV393XSUhl1UAnAeSs6RzkWRFnH3wmB3UAUIugGxzvfzAxpMieX2VuzquWUkhwuT2VzikcZZBQiVrj26Fi5jqn8jo3XYJPWNZ8i-rnnncphwXZljjYZan8hwpweW-LPeQ1JQpMPVNVWmbOrWnfb6mZM2CH4pMG9UJ0rlnrw0LKwo90mK-QGmG-pcQvV_MYg0gKJSk&p=5&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "Food Pantry Coordinator: Sourcing & OperationsSummary: The Food Pantry Coordinator: Sourcing & Operations oversees the back end logistics of Food Pantry operations; including but not limited to food and personal care product sourcing, inventory, and safe storage; pantry stocking and pre-assembled box builds; overseeing order fulfillment for delivery; and associated record keeping.Hours\/Classification: This is a full-time (40 hours), non-exempt (hourly) position. Schedule is generally M-F, plus 1 Saturday morning\/month. (Evening\/weekend hours will likely increase with staffing rotation to cover future Food Pantry schedule expansion.) Occasional additional evening\/weekend hours for special events.Direct Report: The Food Pantry Coordinator reports to the Food Pantry Manager.Job Qualifications: Minimum two years experience in warehouse operations, inventory management, and purchasing required. Prior experience with safe food storage and handling strongly preferred. Prior experience and comfort driving large vehicles (up to 20’ box truck) required. Prior experience and competence using pallet jack and other warehouse experience strongly preferred. Excellent organizational skills, attention to detail, and strong verbal communication skills. Strong interpersonal skills, ability to work well on a team of colleagues with diverse skill sets and experiences. Prior experience supervising staff or volunteers preferred. Basic computer skills including competency in Microsoft Office (word and excel), Sharepoint, Google Applications, and ability to enter data and run reports in database. Ability to multi-task and meet deadlines in a fast-paced environment. Valid driver’s license and ability to be insured under agency automobile policy required. Strong appreciation for organization’s mission, values and approach, with a strong commitment to working with and supporting all members of the Amherst Survival Center community and ensuring the fair and equitable distribution of goods.   ServSafe Food Handler Certification required or must be obtained within 60 days of hire.  Strong preference for candidates who bring additional skills, capacity, and perspective that strengthen our ability to meet our mission such as: language proficiency in addition to English; lived experience with food insecurity; racial, cultural, and ethnic diversity; community engagement; experience working on food justice issues; experience working within organizations on diversity, equity, and inclusion; collaborative leadership, and\/or other relevant skills. Essential Duties and ResponsibilitiesSourcing & Inventory: Oversee Amherst Survival Center warehouse in accordance with food safety standards. Manage accurate inventory of all food and personal care products and complete associated reporting. Complete food and personal care product ordering from Food Bank of Western MA and other sources, maximizing utilization of free and reduced cost product, staying within established budget, and ensuring sufficient quantity of essential food pantry products. Manage retail donation program and pickups. Maintain accurate records of all Food Pantry donations received, complete reporting as required.General Pantry Operations: Ensure Food Pantry is set up and closed properly and kept stocked throughout the day. Oversee assembly and supply of pre-assembled pantry boxes and bags. Complete food pickups and deliveries. Establish a positive, friendly, and productive work environment with Center volunteers, interns, and support staff. Supervise Pantry volunteers, interns and support staff as assigned. Assist with other Pantry roles as assigned, including participant intake as needed. Will be cross trained to support\/fill in for other Center roles as required.Additional responsibilities: Participate actively in full staff meetings, team meetings, and individual supervision meetings. Complete administrative duties as assigned. Demonstrate professionalism at all times, both verbally and in writing when representing the Amherst Survival Center, including appreciating and supporting those you work with, showing respect to all ASC participants, demonstrating professional conduct, acting with honesty and fairness in all of your dealings with others, proactively addressing conflict in the Center as it arises. Approach your work with an attitude of continuous improvement. This involves continually examining processes to discover and eliminate problems in order to improve participant satisfaction and to enhance program effectiveness. Play an active role as part of the Amherst Survival Center team to develop organizational structures and policies, and ensure all program areas fulfill the Center’s mission, including playing an active role in theCenter’s diversity, equity and inclusion efforts. Participate in intentional learning opportunities, including a focus on understanding and dismantling institutional racism and building cultural competency.  Represent the Amherst Survival Center with community stakeholders as assigned.   Other reasonable duties as assigned by Food Pantry Manager, Program Director, Executive Director or designee. Working Conditions: Must be able to lift 70+ pounds. Frequent walking, lifting, carrying, standing, and use of stairs. Frequent typing, writing, talking on phone, and talking in person. The Center is a fast-paced environment which can be crowded and noisy. Position primarily works indoors, with frequent outdoor exposure to load\/unload food, or other related activities. Position requires regular driving of large vehicles and equipment including box trucks, utility vans, and pallet jack.Job Type: Full-timePay: $18.00 - $20.00 per hourBenefits:Dental InsuranceHealth InsuranceLife InsurancePaid Time OffRetirement PlanSchedule:Day shiftMonday to FridayWeekendsCOVID-19 considerations:We are open for services and continue to adapt our operations to ensure ongoing food distribution in as safe a manner as possible. Personal protective equipment is available and social distancing guidelines are followed.Work Location:One locationCompany's website:www.amherstsurvival.orgCompany's Facebook page:www.facebook.com\/amherstsurvivalBenefit Conditions:Waiting period may applyWork Remotely:No"
}, {
    "unique_id": "pj_0da80cccf87a0f7b",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Food Pantry Coordinator: Customer Service & Front End",
    "company_name": "Amherst Survival Center",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Amherst Survival Center",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0CyoL2YPxrGNb8arIjAbJDuvqpZCxeDBI3n_N-b6fEGgzChSRyWtiTI-7q_RR8ZuW8yJSru6Jh7I3jcu-frZo5JQ3iulxW7vDIvk33g4pPHYnGi4oK7AYxLofxP87AUFKI5Ax59FrYOLnI47Bv7SvM8_8HOcPZncTGsE2cVQ8PG81mw9rFL9zpipHle_vabjr4X836nlxBYOO6TaExPri2QzTZLGoJ50OhlsbkCUEpFWPl8Yu9acLLhuAaUE5FbJR-Rv9Uofx7jsu0tpVOVL2RVkyEtvhJC1uaKPMHWEZGrnmjzwioIxHdWIazn16RXfDjA2ZMbreP-_AE120IP3ZcnZmSJmUXWZe7wvNtaCTPAlOuWUxIJzURX1sbA34c0Ye54Ji-edfojkLjEfgt1r6Vb8XL-EShXCSZe0gX9vGCCCIc9SAXspn2wWS36g_8PVzQvGfERR4aB2_99QZlDozx9O0s0qeGKvWg=&p=6&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "Food Pantry Coordinator: Customer Service & Front EndSummary: The Food Pantry Coordinator- Customer Service & Front End oversees the shopper experience at the Food Pantry, including but not limited to onsite, curbside and delivery intake, statistics and reporting, supervising the volunteer shoppers. The Coordinator also provides additional referrals and supports shoppers to access other needed resources.Hours\/Classification: This is a full-time (40 hours), non-exempt (hourly) position. Schedule is generally M-F plus 1 Saturday morning\/month. (Evening\/weekend hours will likely increase with staffing rotation to cover future Food Pantry schedule expansion.) Occasional additional evening\/weekend hours for special events.Direct Report: The Food Pantry Coordinator reports to the Food Pantry Manager.Job Qualifications: Excellent organizational and communication skills and attention to detail. Experience and competence working with diverse communities. Very strong preference for multi-lingual candidates, particularly verbal proficiency in Spanish, Mandarin or Portuguese in addition to fluent verbal and written English. Exceptional interpersonal skills, customer service, compassionate boundary setting, and strength-based approach to working with participants and colleagues. Minimum two years experience in human services, food access, or other social service programs. Experience with local services and referral options for participants strongly preferred. Strong computer skills including proficiency in Microsoft Office, Sharepoint, Google Applications, and ability to enter data and run reports in database. Ability to multi-task and meet deadlines in a fast-paced environment. Valid driver’s license and ability to be insured under agency automobile policy. Strong appreciation for organization’s mission, values and approach, with a strong commitment to working with and supporting all members of the Amherst Survival Center community and ensuring the fair and equitable distribution of goods. ServSafe Food Handler Certification required or must be obtained within 60 days of hire. Strong preference for candidates who bring additional skills, capacity, and perspective that strengthen our ability to meet our mission such as: language proficiency in addition to English; lived experience with food insecurity; racial, cultural, and ethnic diversity; community engagement; experience working on food justice issues; experience working within organizations on diversity, equity, and inclusion; collaborative leadership, and\/or other relevant skills.Essential Duties and ResponsibilitiesWorking with Participants: Ensure a clean, friendly, welcoming, and positive shopping experience for shoppers. Conduct onsite, phone, and web registration with new shoppers, and conduct intake at time of shop. Verify accuracy of information, ensure documentation of all household members to maximize food distribution, and support participants to complete registration process. Respond to pantry related inquiries by phone and email. Provide exceptional customer service. Consistently employ respectful, trauma-informed, and compassionate communication with shoppers. Navigate challenging situations and deescalate conflicts. Uphold Center’s Code of Conduct. Provide accurate information and referral to participants as needed to access additional community resources. Support participants’ successful navigation of Center services. Actively promote equity and inclusion for members of historically marginalized groups including BIPOC, LGBTQIA populations and people living with mental health challenges and disabilities. Support participants’ successful navigation of Center services and provide information and referrals to other food access and related resources.General Pantry Operations: Coordinate delivery orders and calls to participants. Coordination of orders, fulfillment, and execution of curbside pick-ups. Oversee onsite shopping, including supervision of volunteer shoppers. Keep pantry clean, stocked, and well-organized. Assist with other Pantry roles as assigned, including stocking, inventory, and delivery as needed. Will be cross trained to support\/fill in for other Center roles as required.Record Keeping, Statistics, and Reporting: Ensure accuracy of intake and service records, tracking and collating required statistics. Prepare weekly, monthly, and quarterly reports for internal and funder use as required.Additional responsibilities: Participate actively in full staff meetings, team meetings, and individual supervision meetings. Complete administrative duties as assigned. Demonstrate professionalism at all times, both verbally and in writing when representing the Amherst Survival Center, including appreciating and supporting those you work with, showing respect to all ASC participants, demonstrating professional conduct, acting with honesty and fairness in all of your dealings with others, proactively addressing conflict in the Center as it arises. Approach your work with an attitude of continuous improvement. This involves continually examining processes to discover and eliminate problems in order to improve participant satisfaction and to enhance program effectiveness. Play an active role as part of the Amherst Survival Center team to develop organizational structures and policies, and ensure all program areas fulfill the Center’s mission, including playing an active role in theCenter’s diversity, equity and inclusion efforts. Participate in intentional learning opportunities, including a focus on understanding and dismantling institutional racism and building cultural competency. Represent the Amherst Survival Center with community stakeholders as assigned. Other reasonable duties as assigned by Food Pantry Manager, Program Director, Executive Director or designee.Working Conditions: Position primarily works indoors, with some outdoor exposure to load\/unload food, or other related activities. Must be able to lift up to 50+ pounds. Frequent typing, writing, talking on phone, and talking in person. Frequent sitting, walking, standing, use of stairs, lifting and carrying. The Center is a fast-paced environment which can be crowded and noisy.Job Type: Full-timePay: $18.00 - $20.00 per hourBenefits:Dental InsuranceHealth InsuranceLife InsurancePaid Time OffRetirement PlanSchedule:Day shiftMonday to FridayWeekendsCOVID-19 considerations:We are open for services and continue to adapt our operations to ensure ongoing food distribution in as safe a manner as possible. Personal protective equipment is available and social distancing guidelines are followed.Work Location:One locationCompany's website:www.amherstsurvival.org\/jobsCompany's Facebook page:www.facebook.com\/amherstsurvivalBenefit Conditions:Waiting period may apply"
}, {
    "unique_id": "pj_b69406b832e49f42",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Site Surveyor",
    "company_name": "iVueit",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "iVueit\n\n\n\n3.7",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0A2V2cZHZ361k8iovRoUbJAwZMx3nkeP5tUth5mQo9GFX84JE_kPNBP75L_Ym1JzZs50K9JM2Gfa9YF2f7kTGZIXGEgpn7stOG96GCQjVRcpir93OIn6ueGU7FiFfSHoK0VO0G31C6VzsdxUbW13dMdS8N0AEXxKnefAqEvjpTAKO04TJwXXsFBG95Sn8DhRvY1tyRQtDk-dyTqInRk0qIooxMrhgYFVfUFiqpydwJQee8h3aau2BZ-n724_sLlykFdyQmR1zPF2C2qC3A5Kk1kbLuzXpvlQIvSRPOG0XBosnfQ00slnLzHmbq1XSWhso23wpMac5y6fGSWCULv0X_Pg0-kWiylBFTNpyksPc-tqf7Sq-HClZI3IkzwIhVcGgimdVz7_x2BntYGUybm13_sAcr7306ejaNZ_hviXQa_XuqJXSUAnzKZ3kEGL7qV6Ew=&p=7&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "Have a smartphone and an eye for taking photos? Your job is simple with iVueit.We collect data for the Facilities Management industry. Your job is a very simple property audit involving taking photos and answering short questions that the client needs on a large dispersed portfolio base. No tools are required except your smartphone.Responsibilities and Duties: Download the iVueit App from Itunes or Google Play.Locate properties near you on the map and select the job. You can select up to 3 at one time. Just complete one to add more.Travel to the location, take the photos that are requested on the property and answer 6 easy questions and you are done.Submit while on site and once approved you can add the payout for that project to your wallet and check out.Qualifications and Skills: Must have a smart phone, own reliable transportation, have the ability to follow basic tasks well, and be able to take and upload photos.Job Types: Part-time, ContractPay: $14.00 - $100.00 per day"
}, {
    "unique_id": "pj_b9aa074395da5978",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Sr. BI Delivery Specialist- Remote",
    "company_name": "Guardian Life Insurance Company",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Guardian Life Insurance Company\n\n\n\n3.6",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0CZGlY1FoWl0i5gCXisQShMOcvzKlmArtzdEj5wzK5csH370YKZrNLwq8k2M8oX5nvJpkmLxuXJGCtly6l-x9BIBL1m73Ku-ZIS29PmnHBqGu_x2kiww0GCdnDlGmoSRxqTzzOF8OBZRTw9LbhP890j3f1p4LudxceV0oNFMykivEZOpywT5BK2cyWyTRKX3uV7nXtW9YKYfJo1UCY6hKHNb2o_czrAXcwmKN0bfTo0ZY5Pnq3SivkU2SbbQxVMss4gEkwliXA3gMHF20Vz_a_tjnMfGWa1GXKHVN9T_ld0btY2vs-kOUcYhL0J-NPbBItwHG-zaJklPI5yKe_CfuEstaO61pDOojTZYqHW0YaEGS8Q-0u0swHjJUBinu8huWtC7eBpuIhDFxbMmUP36RHjjZNSbVFKVCpHnbXujBKhoqZ4dEEXUTUJ1hI47O3cTR1iff36CpP2XrO86aFo-rru_KFGFalKVTLcSNUNRs8DAKzZJnU4CHe6Wz2HK0HrXYmqSSz60TaTUyiG6_q8tPkxLuo-p5jbbpC3aaVBz4HKONMmew4pSE3H&p=8&fvj=0&vjs=3",
    "date": "2 days ago",
    "full_text": "Sr. BI Delivery Specialist- Remote - (20001070)\nDescription\n\nThe Lead BI Delivery Specialist will be responsible for enabling reporting automation and development via Alteryx and Tableau solutions. The incumbent will be responsible for evaluating data sources relative to reporting requirements, and delivering intuitive, automated, self-service reports for IM business leads.\nCandidate Responsibilities\nBuilding reporting solutions using Tableau, Alteryx and other BI tools.\nWork with key stakeholders to define reporting and visualization requirements.\nDesign, build and test Alteryx workflows to enable automation from data mining to productioanlized dashboards and reports.\nDesign, build and test Tableau dashboards to meet business requirements.\nPerform routine maintenance support, and troubleshoot report issues as well as determine root causes, and implement solutions.\nExecute performance-tuning to achieve optimal performance.\nIdentify and support data gaps and opportunities to augment data assets that enable automation.\n\nFocus on data quality and have strong data validation sensibilities\nReporting Relationships\nThis position reports to the Manager of IM Data & Reporting Team\n\nFunctional Skills\nInterface with key business and project team members to facilitate seamless development of requirements.\nProvides guidance, training, and problem-solving assistance to other team members.\nAbility to translate technical concepts to less-technical business leaders\nWork effectively with associates from across the IM Profit Center and with business and IT partners at all levels of the organization\n\nQualifications\n\nPosition Qualifications\nBS degree in Computer Science, Computer Engineering, or other technical degree\nProven expertise with advanced Tableau functionality and report development\nProven expertise with Alteryx or Tableau Prep tools.\nData visualization - building dashboards and interactive visualizations via best practices in data presentation and design.\nEffective understanding of relational database and warehousing concepts Hadoop, Hive, Microsoft SQL\n5+ years’ experience with above qualifications\n\nLocation-\nRemote\n\nTravel\nMinimal travel - < 10%\n#GuardianBA\n\nAbout Guardian\nGuardian has been helping people protect their futures and secure their lives for more than 150 years. Every day, we serve approximately 27 million people through a range of insurance and financial products. As one of the largest mutual insurance companies, we know what matters most: putting the needs of our customers first. Because everyone deserves a Guardian. Learn more about Guardian at www.GuardianLife.com.\n\nGuardian is an equal opportunity employer. All qualified applicants will be considered for employment without regard to age, race, color, creed, religion, sex, affectional or sexual orientation, national origin, ancestry, marital status, disability, military or veteran status, or any other classification protected by applicable law.\n\n© Copyright 2020 The Guardian Life Insurance Company of America, New York, NY\n\nPrimary Location: United States\nJob: Finance\nSchedule: Full-time\nShift: Day Job\nJob Type: Standard\nTravel: Yes, 10 % of the Time\nJob Posting: Aug 20, 2020, 2:32:55 PM"
}, {
    "unique_id": "pj_d10352d8c1c9959d",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Salesforce Developer",
    "company_name": "Ontrak, Inc.",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Ontrak, Inc.\n\n\n\n3.1",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0A7xu9PvpKn8MWNjG1N92u1AkFKWRqFQXUDfprudZTSmZQWCkXNaJ9qKgQ_TlEkSZXBZAAjJH1LZ61ioXPFPpcn1Nu2Ws1cy7EYVbt7UPg8tJlGVPe9L_H9uEvew4kZB7kHWiNYkvAsqmmHMA6oZrkrUE1ebai7yupWyAM17MtFHQHC2t3-JQxON2Ni18UNCkOrlXzUL54j8odUAJZpYXsHqWtaWb86fQzaAV0d0ksFNPqdFn6BTByG9pp_CQ0HKNcEGj-oSWrtJEKh7FFQUps2jNkbWVsyVcGTqtyPdaP2cvECXDZr9RIRm63TYAQ4PvYmEXw3f4h9pcGBSDodq7q5B2wpgplWKKig7iXyKqJqG8Llw57RDbxMgo6h2YfN2st51Rx8no-bkeKZ-BtLPMnecQRwXHV0lxNcWMajPOWcwJYC7zdWDJ-mQWiQl6FsgrBaHyTi2_cKpg==&p=9&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "BE A PART OF OUR SOFTWARE DEVELOPMENT TEAMAs a Salesforce Engineer (Health Cloud Experience is a plus) you will develop and support the effort to develop Salesforce solutions such as Health Cloud and CRM application that benefit the Ontrak-Inc business. The Salesforce engineer will design, develop, and deploy enhancements to the Health Cloud instance to support process automation. The developer will be creating the new solutions to enable incredible growth in the coming year. The ideal candidate is a self-starter that can work in an agile development environment.The candidate will write maintainable code with extensive test coverage, working in a professional software engineering environment (with source control, dev\/stage\/prod release cycle, continuous deployment). The candidate will build and maintain integrations with other applications and internal product APIs. The candidate must work well in a distributed team environment. This entails an excellent ability to communicate and engage in team development efforts. Experience in Salesforce system architecture and development best practices to scale an instance supporting multiple business unitsESSENTIAL FUNCTIONSDeveloping Salesforce workflows and enhancements to Health Cloud applicationAdministrative tasks (user management, role definition) for the Health Cloud applicationSupport for other Salesforce based applicationsSupport for third party Salesforce componentsPerforms other duties as assignedREQUIREMENTSHigh school diploma or equivalent3+ years in enterprise Salesforce developmentFluency in Salesforce workflow developmentExperience with Salesforce data loading tools, web servicesPREFERRED QUALIFICATIONSBachelors Degree in technology based disciplineExperience in Health Cloud applicationCertification in Salesforce developmentAll work from home opportunities require:A quiet, private, distraction-free home office work environmentA reliable high-speed internet connection (cable, DSL or fiber) with speeds of at least 10Mbps download and 5Mbps uploadWillingness to do constant sedentary workDiscipline to work from home while following a set scheduleBackground check clearanceOntrak, Inc. is making a positive impact on people’s lives every day. We use predictive analytics to identify health plan members with unaddressed behavioral health conditions that worsen chronic disease, then engage, support and guide these members to better health with a personalized, human-centered approach. This has led us to where we are today: growing fast and saving lives as we do.To support our explosive growth, we’re looking for compassionate, hard-working people-lovers to join our team. If innovating in the field of patient care is something you’re passionate about, we encourage you to join our mission to improve the health and save the lives of as many people as possible.Impact lives in so many waysYou'll be an integral part in supporting people coping with their unique life challenges. Every member of the Ontrak team contributes to accomplishing our goals and upholding our people-centric values.The new face of mental healthOur model is research-based, and we are invested in staying on the leading edge of treatment. You'll help us break down barriers and stigmas associated with mental health.Career optionsOur ongoing strong growth and evolution, we are looking for people who want to do their best at work. Join our team and take your career to the next level with Ontrak. We are committed to promoting from within.Excellent compensationIn addition to a competitive wage, we offer comprehensive benefits including medical, dental and vision insurance; a 401(k) plan; paid holiday, vacation and sick time; flexible spending accounts; Basic Life\/AD&D, Employee Assistance Program and Travel Assistance Program and more.Ontrak, Inc. is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.Notice to candidates: Please visit our fraud alert to protect yourself from scams targeting job seekers: https:\/\/catasys.com\/fraud-alert.htmlJob Type: Full-timePay: $88,356.00 - $163,497.00 per yearSchedule:Monday to FridayExperience:salesforce development: 3 years (Required)Salesforce data loading tools, web services: 3 years (Required)Health Cloud Applications: 1 year (Preferred)Education:Bachelor's (Preferred)License:Salesforce Developer (Preferred)Work authorization:United States (Required)Work Location:Fully RemoteCompany's website:https:\/\/catasys.com\/careers.htmlWork Remotely:Yes"
}, {
    "unique_id": "pj_f4133ad05f52a05e",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Sr. DBA\/SQL Developer",
    "company_name": "SQLWatchmen, Inc.",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "SQLWatchmen, Inc.",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0AkCyYuZbqO9orEDvRoNnHCZGUdVyuwlHUKHY-kCofdObbh7kmQ9gNxCQTHeyPsqzk-bDKRQZf2r8KELMd01K_bbhqVetf9TZ7q62uxyrkKwQHifoTMYC-vrErDrOkcfGigB9rJ-U9Z8XP40WiyYMbtN3N4CJQ8aNMVVMpB6TcsK6lhbAUlvD1Iog0V4hOvY-x_cRHFakG2OMRaLB0NDhnuAXWCQF6BZzgxmL0RHOGLrX_BpjdSu2RpbbH9KSf_wQK8LoFp5WiXeWZIf5UwIB-90-EoSe7AO7Ey_iPmnGO_qaHAbj1XYWNud27sV6O2F7fmAfFoxq0LaBMyychuGu8gdRLBezbU6th7molv_D-QKELmm-6zIQ7J6t4ncI-D8myy2F97803twzXYTv1YeamCsxlBRWIiMWhbrQylrmGzvp11ftK_gBPg&p=10&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "Wanted:  Sr. DBA\/SQL DeveloperObjective:  Are you the go-to person at your shop whom the rest of the team looks to for the answers? Are you the person they depend on to save the day? If so, WE WANT YOU!Qualities:  We are seeking the type of personality who wants to make a real difference. We are not just looking for a DBA\/Developer, we are looking for a specific type of person – one who matches who SQLWatchmen is and why our customers love us so much. Soft skills and personality traits are as important as the technical skills.You are a great fit if you are…a person with passion for learning and professional developmenta person who enjoys working independently to knock out your share of the workready to collaborate with the team to work out the best solution possible, even if the solution is not your owneager to assist others to troubleshoot and help solve a challenging problema sharp thinking analyzera very responsible person with a strong sense of personal accountability who takes pride in ownership of their worka top-tier, humble yet confidant individuala consistent worker who produces superior quality of work and who has a strong attention to detaillooking to be on a team where you can grow each otherSkills & Competencies: Monitor SQL Servers and proactively resolve issues.Demonstrate advanced technical and T-SQL programming skills.Performance tuning (Index tuning and Query tuning).Develop HA\/DR strategies, and monitor and maintain them. (Cluster, Mirroring, AlwaysOn, Replication, Log Shipping).Securing data and access to SQL Server.Use SSIS to import data, write calculation Stored Procedures\/Views and export data back out.Architect and Design new and existing databases and tables.Demonstrate advanced technical and programming skills.Design, implement, and maintain data warehouses\/ODS systems using SQL Server Replication, SSIS, SSAS, and T-SQL scriptingWork with business stakeholders to create and maintain reports in SSRS using relational & SSAS data sourcesBe on-call for emergency coverage in rotation with several other DBA’s.When on-call, Respond to text messages within 1 hour.This role is very unique and not for everyone. However, it is amazing for the right type of individual.Position is for a direct W-2 full-time employee only. No contractors or contracting companies.SQLWatchmen will not sponsor applicants for work visas.About Our CompanySQLWatchmen, Inc. has been in business for over 8 years. We are a fast-growing small tech startup environment that is looking for great people to help us grow.Job Type: Full-timePay: $100,000.00 - $130,000.00 per yearBenefits:Health InsurancePaid Time OffSchedule:Monday to FridayExperience:Microsoft SQL: 3 years (Required)Location:United States (Required)Work Location:Fully RemoteVisa Sponsorship Potentially Available:No: Not providing sponsorship for this jobCompany's website:https:\/\/www.sqlwatchmen.comBenefit Conditions:Only full-time employees eligible"
}, {
    "unique_id": "pj_c054057bba2b3a96",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Big Data Engineer - 100% REMOTE!",
    "company_name": "Tech Quarry",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Tech Quarry",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0DPmg97y4kWCkYTNaT81OuN_3x50ry2H7i4L3G8TFhdAUGPiR8bL-BkPGgbG4c7lqxb5asphMhSRcObqsQwwMOUizui_ssE0GVDQnZ_jwa-Xzsuiyyn3pEG3lf5jc2o1LN2Ila4bZmqfiAapA_gcNbmzA9lZs7Xh8UwmcA9Win-_5xsu_XGgUm0-q8b2ALXoIWkKUJD-lAGgfjgzLl2BtYAc5Q_-SQUA1I3RmOcmqpNVD1rdqsvHMVPGZffKKl0t50Ta-FU7g-N8UR-wHcSwm9JeHKHQ3SZNThYAL09c6kcT-LFrPL9BanJKqxaN4v0N0V3-GoKt3TN1BlJzV0WcFOOzBzyc9luzjMy-hfWKcqyiGG5ptLj8O1lnRaPmsrM5zPHvOzy9-oh5hbQm6VGVdIlF19uLwUsTTI744BiBWCh7C_yhnTy6A8E21EJN_aVLpg=&p=11&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "**Absolutely No 3rd parties \/ No C2C, please***Big Data Engineer - 100% Remote!Pay Rate: $75-115\/hr, however, DOE!Benefits:  Health benefits offered with partial premium paid!i.e. Medical, dental, visionType: Long term contract to hire (6+ mo to start)JOB DESCRIPTION: Our world renowned client has an opening for a Big Data Engineer to design and implement data models, build data pipelines, and large data sets. This is a hands on coding\/development role and the incumbent will provide an end to end solution in a big data, modern tech, cloud environment. This is a client facing position - internal, external & offshore vendor partners - as well as partnering with architects and analysts. Strong opportunity for multiple extensions and\/or conversion to permanent\/direct hire employee. This position is 100% remote role, with headquarters located in San Antonio, Texas. Please note that pay is commesurate to experience. **Our client is actively hiring regardless of COVID-19!**REQUIREMENTS: 5+ years' Data modeling, design, and implementation5+ years' Advanced SQL development: Hive\/SparkExperience building:Data pipelines in Python\/Scala or Java (Linux shop)Data warehousesData Lake using HadoopData structures to support analytic tools: Tableau, Datameer, or RCloud experience: AWS (preferred), Azure or multi4+ years' experience working with Business and Tech domain leadersAutonomous work style; innovative executorStrong communication skills to tech and non-tech businessAbility to go from whiteboard discussion to codeStellar work ethic, 'Whatever it takes’ attitude, and easily accepts constructive criticismPreferred experience: Cloudera or Snowflake experienceAgile environmentsBachelor's degree**Absolutely No 3rd parties \/ No C2C, please***Please send your Word.doc formatted resume to: Talent dot manager at techquarry dot comJob Type: ContractPay: $75.00 - $115.00 per hourBenefits:Dental InsuranceHealth InsuranceVision InsuranceSchedule:Monday to FridayCOVID-19 considerations:100% fully remote!Experience:AWS: 3 years (Preferred)Hadoop Ecosystem: 4 years (Required)hands on development of data pipelines, DW & Data Lake: 5 years (Required)Full Time Opportunity:YesWork Location:Fully RemoteThis Company Describes Its Culture as:Detail-oriented -- quality and precision-focusedInnovative -- innovative and risk-takingOutcome-oriented -- results-focused with strong performance cultureTeam-oriented -- cooperative and collaborativeCompany's website:www.techquarry.comBenefit Conditions:Waiting period may applyWork Remotely:Yes"
}, {
    "unique_id": "pj_85786a39b3e911d8",
    "city": "01002",
    "job_qry": "data",
    "job_title": "SAP Functional Data Integration Architect",
    "company_name": "OmniPoint Staffing",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "OmniPoint Staffing\n\n\n\n3.7",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0Bi13YOoGWmRY7Yy9bRK6kkQ5f6Da_MUN38be7Xkoe50H0Di0G0TO0WTLSl1BSIAXddyZkRjZ7wytRLUOwRWfupRIIoPAvSWWN5EbavZDPM1lMEbGIY-Pl_eH8k4ascabM1lxa2fkLu46QP_6MXHMrt9Tf35BGcZ_vZam6lVkkkEAZ9rBZ3rvUjN9HPXjvP6hGKfZOreChuCLI1Lweb3SrAJCLumpHeWYeRuPOG9BkmjpfMdW9NoyKfb8MK8ZOT8vC-U0KB_ZsYDCX86_hYjxXzZA4PgUFvfDT85uBzhMkGVyE3cTR_rDPp0JRBa_FSwGh1EUWdnUUIfmP8HDf8yLgJtv1TKYoZ1KVXtEfxiR63_3suKJd1e04PovzV89RpNXeWtIf7GyZ6YU_-LDKs2_Qn7_p01GEM527-BaUZkvGfBREcYpyeYZ7uZ2o5P3oOBdvAuXdXY2OwDA==&p=12&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "Average day in the life for this role: Design, development, testing, participating in design workshops, participating in deployments Years of experience required for each skill: 7-8 yearsFunctional Design (Percentage of time spent : 30%)o Gather the \/PHI - SAP HANA S\/4 Conversion requirements from the client through a series of workshopso Present the “As-is” Vs “To-be” state of the business and system processes to the cliento Document the key design decisions and assumptions to be used for the process designo Create functional design document covering all the functional aspects of the software system including the test scenarios\/conditions on which the functional requirements will be confirmed to be meeting the expectationsTechnical Design (Percentage of time spent : 30%)o Review the functional design and convert the functional process steps into technical steps for implementation through program or RICEFWs (Report, Interface, Conversion, Enhancement, Forms and Workflows) objectso Document all technical aspects of the functional requirements such as exceptions, error handling, user interface, input validations and integration with the backend systemso Implement the program changes in the system to meet the functional requirements via ABAP code changes, Fiori App for User Interface and Business role definitions for appropriate level of accessSystem Integration, Performance and User Acceptance Testing Support (Percentage of time spent : 20%)o Help triage the defects raised during the system integration, performance testing and user acceptance testingo Implement fixes for the defectso Apply the fixes to the quality and production systemso Help tune the performance of SAP objects identified as not conforming to the agree upon acceptance criteriaDeployment Support (Percentage of time spent : 10%)o Package the SAP development objects for production deploymento Identify and document the object dependencies to prevent deployment errorso Identify and prepare the list of technical and functional checks to be performed after the deploymento Help retrofit the project changes on the production operations systemsPost Deployment Support (Percentage of time spent : 10%)o Help triage the defects raised after the go-liveo Implement fixes for the defectso Apply the fixes to the quality and production systemsWill be remote until end of 2020, there is possibility for travel in 2021.Job Type: ContractPay: $90.00 - $100.00 per hourSchedule:Monday to FridayContract Renewal:Possible"
}, {
    "unique_id": "pj_9b35de3a33f5296a",
    "city": "01002",
    "job_qry": "data",
    "job_title": "RPA Developer (UiPath)",
    "company_name": "Momentum Consulting Corporation",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Momentum Consulting Corporation",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0DlIYJakkQiODBov9lKyie9qXWelDckN1Z4jTEz2rLB5c-4j4jSb-Ry-VRAKE6GWOyIrjKe-RzvgUlkOcXv4aq4kwXUQ_tv950Jcka5oBwSO4Gzg8HSYJ3EnKgSYRkAO-C3hlp1jtzQIMMYACFd2WNZ6SYZjaaM3omtTZ_72vkdhEsK-SEgworC-wKwJHK8iq0wWIEU-JYMsg6Lzhzk9J8S-637KPoo6qe69FbfKkG0Rc7plRWHrtie-ahLh07y1ZV4rvE5N5DlNlLOmNjq6RYwvcSadGyGiirVWIYtW0eQo0O4F6uePSHU85qGZQt3OPuCk2AUTVnfW9Go0buv2sq7uqmkF2dmBW8LdhHWGKnDBtzYnr1UzFu9mptsMMepmpkLWw9vdclJbSqxQKnjxUBwOZ0gyrZ2pSgRlcJFwOksAuL3pr5sXnCWdgl6dZZ_0Uc=&p=13&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "The RPA Developer I will support the development and implementation of cost-effective robotics automation solutions to meet business objectives by coordinating detailed technical analysis, design, and investigating new approaches.How you will make an impact: Identify new process opportunities and accurately analyzing and estimating new processes, quickly assessing feasibility.Analyze, understanding and documenting the business processes in detail where required.Identify and communicating the technical infrastructure requirements.Design UiPath process solutions in accordance with RPA CoE and UiPath design principles and conventions.Configure new UiPath processes and objects using core workflow principles that are efficient, well structured, within our framework, maintainable and easy to understand.Create and maintaining solution documentation.Support existing processes and implementing change requirements as part of a structured change control process.Solve issues that arise in day to day running of UiPath processes and providing timely responses and solutions as required.Communicate with UiPath on software related issues, suggested improvements and participating with other users in the UiPath community.Work within the RPA squad planning constraints, communicating identified risks and issues to the iteration lead, and providing inputs to the change control process.Create and document test procedures and scenarios for the pre-UAT phases and supporting the Operational Teams during the UAT and rollout phases.Required Expertise: Bachelor of Computer Science, Engineering or comparable technical degreeUiPath Academy Developer certification (preferred)Solid understanding of all aspects of the RPA domain and experience with process engineering and re-engineeringMore than 4 years of experience designing, implementing and managing an automation system on an enterprise-level scaleFundamental understanding of software engineering principles such as encapsulation, extensibility, and maintainabilityMore than 2 years of extensive experience working with leading RPA and intelligent automation platforms including UiPathIn-depth knowledge of UiPath development and Object-Oriented Programming (OOPs) languagesMore than 2 years of experience designing, developing and testing RPA and intelligent automation solutions using UiPathProficiency with various scripting, programming, and web development languages such as SQL and C#Understanding of multi-tier application design and experience in building solutions from the ground upPossess an understanding of data and on how to navigate ill-defined problem setsExperience with the implementation of any ML\/AI related technologies or use cases related to RPASolid understanding of Agile Software Development Lifecycle and basic brokerage middle and back-office operational processesExcellent, clear verbal and written communicationThis is a remote role, consideration given to candidates in Florida but would also consider C2C candidates throughout the USPreferred Expertise: Excellent technical documentation skills..NET, C# programming knowledgeSQL basic understandingJob Types: Full-time, Temporary, ContractPay: $65.00 - $75.00 per hourSchedule:Monday to FridayExperience:software development: 2 years (Preferred)designing, developing and testing RPA solutions: 2 years (Required)UI Path: 2 years (Required)Education:Bachelor's (Preferred)Work authorization:United States (Required)Contract Length:5 - 6 monthsContract Renewal:PossibleWork Location:Fully RemoteThis Company Describes Its Culture as:Detail-oriented -- quality and precision-focusedInnovative -- innovative and risk-takingOutcome-oriented -- results-focused with strong performance culturePeople-oriented -- supportive and fairness-focusedCompany's website:https:\/\/www.momentumcc.com\/Company's Facebook page:https:\/\/www.facebook.com\/MomentumConsultingCorp\/Benefit Conditions:Only full-time employees eligible"
}, {
    "unique_id": "pj_a30df749aa25ce20",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Netsuite Software Sales Engineer",
    "company_name": "Confidential Privately-Held Company",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Confidential Privately-Held Company",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0BbH1ssEeQEQbedQdhzvve1cg4wSOj2DvXHDgLsjavKK96Ij0MLOKHGwLz8ywPgc0UOdTRtx8-dSGByM1BDPhF2A4PoSBM3gIV-WNJCcqNsy5ZoWH3nQvryLDNY9sMPKzv3XsfuXsgmYKcEhoMLIjut-Gl8Etos-2sJQbfcuYft3r5aF1avASSlkIqfPb39N5eWXWk501uwTpV0etfKWv66rCqbU7JjI8eG-Sg-eILIgvekfxN3KB62HKVvUViNQ_S6H_mYqIBa63l7pfxxahKRPjf-5dJhd_bmvBddPT0StXw3KUzXpNyFZg8AW-BiDfR859RKbhQfqWSaHag-tSXlSBATF19lVg1VSMypg69K6WNWbX0ldvfK__0wXhtb56CnejwQWadW7YDRbR5Tsu7mZMHX0g7QRl5ij_rdnCjWuGOwx5DVb01W8YC047qrMZF3SBA5xqQJcw==&p=14&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "Come Join Our Dynamic Team!*The main function of this position facilitates world-class consulting, implementation, and strategic services to our customers, with focus on the sales process. The Sales Engineer supports client implementation, service or upgrade related projects, but more commonly partners with Business Development to drive and close new business or inside sales. This might include composing demo scripts, presenting demos, sales presentations, requirement discovery and other related sales activities. The Sales Engineer manages tasks, client expectations, and deadlines, and is essential to the business development process as well as, the relationship building effort that leads our firm to long-term partnerships with our clients.Main duties include:Partners with Business Development to generate consulting or service opportunities.Discovers and evaluates requirements, generates demo scripts, presents demonstration, actively participates in closing new and expansion of existing business.Performs, supports or delegates data migration services including data scrubbing, file manipulation, file mapping and other project related data tasks. Also supports implementations or service projects as directed by Senior Consultants or Practice Managers.Leads consulting engagements including, but not limited to high level process analysis, process recommendation, and transactional flow analysis.Achieves advanced\/master level competency in our core product offerings ( NetSuite, Adaptive, etc.) and applicable database and reporting engines within mutually established timeframe, with emphasis on demonstration, and client-facing contemporaneous live demo\/discussion.Other duties as assigned.Qualifications and Competencies Summary:High School Diploma or GED.Experience leading and\/or participating in 10-15 multi-phased ERP implementations or service engagements, including planning, delegation, status updates, functional and technical work, process flow discovery, design and mapping, training, testing, go-live support and project management.5-8 years of experience in business process analysis and solution design with emphasis on Accounting\/Finance, Manufacturing and Distribution.2-3 years of software requirement gathering\/demo scripting and demonstration experience with emphasis on “telling the story.”Performed project or team coordination including meeting scheduling and preparation.Experience in client communication, in person, email or voice, with emphasis on conflict and issue resolution.Collaboration experience related to projects, teams, or other initiatives.Experience in capturing critical meeting information, synthesis, documentation organization and recap.Experience preparing and editing complex spreadsheets (e.g. Excel) and other electronic documents.Skills and\/or Licensing\/Certification(s) Required:Microsoft Office Suite, including Office 365Proficient in Excel, Word, PowerPoint, Outlook (email and calendar), TeamsIntermediate experience in GoogleDrive\/Docs\/Sheets\/SlidesCertification or equivalent experience in related ERP package (minimum Financials and Distribution modules)Certification or equivalent experience in related reporting engine (Crystal Reports, etc.) and data import\/export engines.As applicable, certification or equivalent experience in related database engineCertification or equivalent experience in related process workflow engine(s).Demonstrated leadership ability, both internally and with clients.Command of English languageAbility to develop and maintain team and client relationships.Job Type: Full-timePay: $73,554.00 - $125,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insurancePaid time offVision insuranceSchedule:Monday to FridaySupplemental Pay:Bonus payExperience:ERP: 3 years (Preferred)Education:Associate (Preferred)Work authorization:United States (Preferred)Work Location:Fully RemoteThis Job Is:A job for which all ages, including older job seekers, are encouraged to applyOpen to applicants who do not have a college diplomaBenefit Conditions:Waiting period may apply"
}, {
    "unique_id": "pj_85786a39b3e911d8",
    "city": "01002",
    "job_qry": "data",
    "job_title": "SAP Functional Data Integration Architect",
    "company_name": "OmniPoint Staffing",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "OmniPoint Staffing\n\n\n\n3.7",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0Bi13YOoGWmRY7Yy9bRK6kkQ5f6Da_MUN38be7Xkoe50H0Di0G0TO0WTLSl1BSIAXddyZkRjZ7wytRLUOwRWfupRIIoPAvSWWN5EbavZDPM1lMEbGIY-Pl_eH8k4ascabM1lxa2fkLu46QP_6MXHMrt9Tf35BGcZ_vZam6lVkkkEAZ9rBZ3rvUjB9x4NIBEnZaVNyAF45RtNsUo6G0GS-Aw-o8b2FmZqe5i5BKvs92aSyQ7mP8I-rx3dPnwIiNBtcuQeO1byWlwhPnlLMR9vRobcGbYVDWIgCnCrhvXRjG5eOONtYRRQuFgzsW_V3cpyWZgCSVh7rKujjD30aenR9Z1Fl9Oh7u0xoy9fvd_i-s8eTxI8RngYiH8vQglk4js8rZckNag3BFKV6O7s5eVmUXlj-62COI8Qp9Qj8gr126RCZiQ08lRD98oa1Owx9vnWKxw9FTExftZTA==&p=0&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "Average day in the life for this role: Design, development, testing, participating in design workshops, participating in deployments Years of experience required for each skill: 7-8 yearsFunctional Design (Percentage of time spent : 30%)o Gather the \/PHI - SAP HANA S\/4 Conversion requirements from the client through a series of workshopso Present the “As-is” Vs “To-be” state of the business and system processes to the cliento Document the key design decisions and assumptions to be used for the process designo Create functional design document covering all the functional aspects of the software system including the test scenarios\/conditions on which the functional requirements will be confirmed to be meeting the expectationsTechnical Design (Percentage of time spent : 30%)o Review the functional design and convert the functional process steps into technical steps for implementation through program or RICEFWs (Report, Interface, Conversion, Enhancement, Forms and Workflows) objectso Document all technical aspects of the functional requirements such as exceptions, error handling, user interface, input validations and integration with the backend systemso Implement the program changes in the system to meet the functional requirements via ABAP code changes, Fiori App for User Interface and Business role definitions for appropriate level of accessSystem Integration, Performance and User Acceptance Testing Support (Percentage of time spent : 20%)o Help triage the defects raised during the system integration, performance testing and user acceptance testingo Implement fixes for the defectso Apply the fixes to the quality and production systemso Help tune the performance of SAP objects identified as not conforming to the agree upon acceptance criteriaDeployment Support (Percentage of time spent : 10%)o Package the SAP development objects for production deploymento Identify and document the object dependencies to prevent deployment errorso Identify and prepare the list of technical and functional checks to be performed after the deploymento Help retrofit the project changes on the production operations systemsPost Deployment Support (Percentage of time spent : 10%)o Help triage the defects raised after the go-liveo Implement fixes for the defectso Apply the fixes to the quality and production systemsWill be remote until end of 2020, there is possibility for travel in 2021.Job Type: ContractPay: $90.00 - $100.00 per hourSchedule:Monday to FridayContract Renewal:Possible"
}, {
    "unique_id": "pj_c054057bba2b3a96",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Big Data Engineer - 100% REMOTE!",
    "company_name": "Tech Quarry",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Tech Quarry",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0DPmg97y4kWCkYTNaT81OuN_3x50ry2H7i4L3G8TFhdAUGPiR8bL-BkPGgbG4c7lqxb5asphMhSRcObqsQwwMOUizui_ssE0GVDQnZ_jwa-Xzsuiyyn3pEG3lf5jc2o1LN2Ila4bZmqfiAapA_gcNbmzA9lZs7Xh8UwmcA9Win-_5xsu_XGgUm056hAbbu_xGlsTTOq02RvbCJyF04IACrfFaAZTURFmOOcw5KolmIc-oJcnVH2VXZ9_GFvXIqXtLvUmdcpNZrlUia6jyzvE6Sh19ovEx5RWqXEjccL85gtSFjGMVXITZd7pWOrAP26YAgOICQrKUe_9hAqxXXB4mMKaVL-aNxpAsxkcm5EIdD-9q3e2F4rMdWWFndj3Cds_DhINLpp2pt2nBt_pBNoyjlbH6nMlHVjg8-Qrz4nRmFx56HXaQ-Yov3T7vAfyRS12DI=&p=1&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "**Absolutely No 3rd parties \/ No C2C, please***Big Data Engineer - 100% Remote!Pay Rate: $75-115\/hr, however, DOE!Benefits:  Health benefits offered with partial premium paid!i.e. Medical, dental, visionType: Long term contract to hire (6+ mo to start)JOB DESCRIPTION: Our world renowned client has an opening for a Big Data Engineer to design and implement data models, build data pipelines, and large data sets. This is a hands on coding\/development role and the incumbent will provide an end to end solution in a big data, modern tech, cloud environment. This is a client facing position - internal, external & offshore vendor partners - as well as partnering with architects and analysts. Strong opportunity for multiple extensions and\/or conversion to permanent\/direct hire employee. This position is 100% remote role, with headquarters located in San Antonio, Texas. Please note that pay is commesurate to experience. **Our client is actively hiring regardless of COVID-19!**REQUIREMENTS: 5+ years' Data modeling, design, and implementation5+ years' Advanced SQL development: Hive\/SparkExperience building:Data pipelines in Python\/Scala or Java (Linux shop)Data warehousesData Lake using HadoopData structures to support analytic tools: Tableau, Datameer, or RCloud experience: AWS (preferred), Azure or multi4+ years' experience working with Business and Tech domain leadersAutonomous work style; innovative executorStrong communication skills to tech and non-tech businessAbility to go from whiteboard discussion to codeStellar work ethic, 'Whatever it takes’ attitude, and easily accepts constructive criticismPreferred experience: Cloudera or Snowflake experienceAgile environmentsBachelor's degree**Absolutely No 3rd parties \/ No C2C, please***Please send your Word.doc formatted resume to: Talent dot manager at techquarry dot comJob Type: ContractPay: $75.00 - $115.00 per hourBenefits:Dental InsuranceHealth InsuranceVision InsuranceSchedule:Monday to FridayCOVID-19 considerations:100% fully remote!Experience:AWS: 3 years (Preferred)Hadoop Ecosystem: 4 years (Required)hands on development of data pipelines, DW & Data Lake: 5 years (Required)Full Time Opportunity:YesWork Location:Fully RemoteThis Company Describes Its Culture as:Detail-oriented -- quality and precision-focusedInnovative -- innovative and risk-takingOutcome-oriented -- results-focused with strong performance cultureTeam-oriented -- cooperative and collaborativeCompany's website:www.techquarry.comBenefit Conditions:Waiting period may applyWork Remotely:Yes"
}, {
    "unique_id": "pj_a30df749aa25ce20",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Netsuite Software Sales Engineer",
    "company_name": "Confidential Privately-Held Company",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Confidential Privately-Held Company",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0BbH1ssEeQEQbedQdhzvve1cg4wSOj2DvXHDgLsjavKK96Ij0MLOKHGwLz8ywPgc0UOdTRtx8-dSGByM1BDPhF2A4PoSBM3gIV-WNJCcqNsy5ZoWH3nQvryLDNY9sMPKzv3XsfuXsgmYKcEhoMLIjut-Gl8Etos-2sJQbfcuYft3r5aF1avASSl-9cPTffUY5e0eUr53Cl9_db3H77oDO9McTdyaGnGjwu16b2UE-jWGZKaHRhWRIkEMoiF2YnGUi1amXHt1JATcSlJi287dt86ijmpH6CIEDNDKbViToWv06SxMPdBv3t-BnyGCBN9T6Yp4jsCCG_dB-negBGRZgK6oi82uXC3qtbVFXWZUOF3NUTaNnFbF6XVJWTjofTVq_JzUVowftaAq0esl5pkSMhw0rWYKhKBqXrzdl0UDNepfzQnTuogojVfg-Y_Sou1KkhVHMdh7pYwQQ==&p=2&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "Come Join Our Dynamic Team!*The main function of this position facilitates world-class consulting, implementation, and strategic services to our customers, with focus on the sales process. The Sales Engineer supports client implementation, service or upgrade related projects, but more commonly partners with Business Development to drive and close new business or inside sales. This might include composing demo scripts, presenting demos, sales presentations, requirement discovery and other related sales activities. The Sales Engineer manages tasks, client expectations, and deadlines, and is essential to the business development process as well as, the relationship building effort that leads our firm to long-term partnerships with our clients.Main duties include:Partners with Business Development to generate consulting or service opportunities.Discovers and evaluates requirements, generates demo scripts, presents demonstration, actively participates in closing new and expansion of existing business.Performs, supports or delegates data migration services including data scrubbing, file manipulation, file mapping and other project related data tasks. Also supports implementations or service projects as directed by Senior Consultants or Practice Managers.Leads consulting engagements including, but not limited to high level process analysis, process recommendation, and transactional flow analysis.Achieves advanced\/master level competency in our core product offerings ( NetSuite, Adaptive, etc.) and applicable database and reporting engines within mutually established timeframe, with emphasis on demonstration, and client-facing contemporaneous live demo\/discussion.Other duties as assigned.Qualifications and Competencies Summary:High School Diploma or GED.Experience leading and\/or participating in 10-15 multi-phased ERP implementations or service engagements, including planning, delegation, status updates, functional and technical work, process flow discovery, design and mapping, training, testing, go-live support and project management.5-8 years of experience in business process analysis and solution design with emphasis on Accounting\/Finance, Manufacturing and Distribution.2-3 years of software requirement gathering\/demo scripting and demonstration experience with emphasis on “telling the story.”Performed project or team coordination including meeting scheduling and preparation.Experience in client communication, in person, email or voice, with emphasis on conflict and issue resolution.Collaboration experience related to projects, teams, or other initiatives.Experience in capturing critical meeting information, synthesis, documentation organization and recap.Experience preparing and editing complex spreadsheets (e.g. Excel) and other electronic documents.Skills and\/or Licensing\/Certification(s) Required:Microsoft Office Suite, including Office 365Proficient in Excel, Word, PowerPoint, Outlook (email and calendar), TeamsIntermediate experience in GoogleDrive\/Docs\/Sheets\/SlidesCertification or equivalent experience in related ERP package (minimum Financials and Distribution modules)Certification or equivalent experience in related reporting engine (Crystal Reports, etc.) and data import\/export engines.As applicable, certification or equivalent experience in related database engineCertification or equivalent experience in related process workflow engine(s).Demonstrated leadership ability, both internally and with clients.Command of English languageAbility to develop and maintain team and client relationships.Job Type: Full-timePay: $73,554.00 - $125,000.00 per yearBenefits:401(k)401(k) matchingDental insuranceFlexible scheduleHealth insurancePaid time offVision insuranceSchedule:Monday to FridaySupplemental Pay:Bonus payExperience:ERP: 3 years (Preferred)Education:Associate (Preferred)Work authorization:United States (Preferred)Work Location:Fully RemoteThis Job Is:A job for which all ages, including older job seekers, are encouraged to applyOpen to applicants who do not have a college diplomaBenefit Conditions:Waiting period may apply"
}, {
    "unique_id": "pj_964e949abeab2831",
    "city": "01002",
    "job_qry": "data",
    "job_title": "JavaScript \/ Ruby on Rails Developer - Remote \/ Work from Home",
    "company_name": "Tithe.ly",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Tithe.ly",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0B1j9VKoTmbEJmaWB7DxLcFrik2ktj_QtCgt1I5-dtiXE5nzkkMsztVkQs4gJi61OJ3p5Bbu65kuxDL8Wb5bXrEh_Q2oOI2tWgLahbMr0ZFQM70oviQiX8DGwyID1lBVhD4URIz3ON6-AJ7nQyewXtKJrAMUCjN3UxOPgXIw17JCS2o-fEhS-_Uv16gAjuyAtQgjCwmrT3CJhCIJeHI-5UxDI7c4DKbJclaiDbM67R5ufY33fHaepoaW_a0i5XImXKtO5iKeNTA8WN7truuikZGYvw7G8N-JpstrK8woICMbG3XcRHc-EfAk9tdHORAuJHGxK9gr3km6lhyQ7XGkuYvCr_7oje5woDjUJm_Q7Tf_VRWX8gv5oKO4OQBwTDX21eg5hnzUVtKcW7IJPIYOj49VISu9aEw-us5oKIjhcoIiZRnW5cexJzc2-lREjpBhl8oWC0NUsqciau_-PkKWz_qtPHU5HIvOeY=&p=3&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "### ABOUT THE JOBTithe.ly is currently looking to recruit a full-time full-stack programmer, who has more of a front end bias, to join a team focused on writing code to support our product ecosystem.The successful candidate will find themselves working with Ruby on Rails, JavaScript and CSS, contributing heavily to our web-based software. The candidate will also have the chance to grow their skillset under a highly skilled team that can guide the candidate and unlock their full potential.This position affords the opportunity to collaborate with other experienced engineers while also providing plenty of space for autonomy and coding. You will need to be able to think on your feet, be innovative and be independent when required.This is an awesome opportunity to get involved with a growing company that practices continuous development and building something great! You will be joining a very friendly and social team, who are highly skilled technically, where you will be working with the latest technology.100% remote opportunity, but must be based in the US or Canada.The salary will depend on the level of experience.### ABOUT YOUWe are looking for an experienced candidate that doesn't necessarily know all the answers but is motivated to learn, willing to grow, and is open to change.Technology:* 2+ years experience in Ruby\/Rails* Extensive experience in writing unit and integration tests* Solid understanding of RESTful APIs* Experience with using non-trivial APIs to read and save data* Solid understanding of JavaScript (JQuery and VueJs preferable), CSS (Less and SCSS preferable), HTML* Solid understanding of Git* Experience with writing SQL queries and using MySQL\/PostgreSQL* Experience working with Docker* Comfortable working in a Unix\/Linux environment* Ansible\/Capistrano knowledge would be usefulHuman \/ Relational:* Great community both verbal and in written form* Find joy in working out solutions to tricky problems* Willingness to learn and expand upon existing skill sets* A team player & able to work without supervision* Quick learner & takes initiative* Possess a high level of attention to detail* Ability to effectively communicate technical information into simple terms* Have a friendly, patient & positive nature### APPLYINGPlease send an application that speaks directly to this position. There are no right answers or cookie-cutter expectations. Show us your role in Tithe.ly’s future and Tithe.ly’s role in yours. Address some of the work we do. Introduce yourself as a colleague. Give it a deep think and take this at your speed. We’re giving you our full attention.There’s no benefit to writing a novel. Keep it sharp, short, and get across what matters to you.Next: We expect to take up to a week to review all applications. You'll hear from us about advancement to a written code review. We use an online platform that presents you a few code challenges for you to complete. We'll then do a quick 15-minute video call. If we feel you could be a good fit, then on to a full interview. Our interviews are one hour, all remote, with your future colleagues. We’ll talk through some of your code and some of ours. No gotchas, brainteasers, or whiteboard coding. We aim to make an offer when we feel we have found the right candidate.Job Type: Full-timeSalary: $60,000.00 - $80,000.00 per yearSchedule:Monday to FridayExperience:Ruby on Rails: 2 years (Required)JavaScript: 2 years (Preferred)Work Location:Fully RemoteCompany's website:https:\/\/get.tithe.lyWork Remotely:Yes"
}, {
    "unique_id": "pj_263993e79d90788f",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Application Engineer - Flow Cytometry",
    "company_name": "LASE Innovation",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "LASE Innovation",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0BWRwNpcjp9r4OzhAyAxTG3pcCFLkqnYYrytTWL2l9NhQ5wcFSG4dHum7yJz26oinD5YWliA9N2edjkvjDivThUD-mqUSosK4w7VFGABpYtAVkMGZSDrVM4Qz53UQSxeKtJMTjLmHipVuSCW8ntmNQPzx2-ZPth9wNYvz1HZAlKAtyLo8lbxzJSr-gTA7RIRT83gt6IreZLv2t3yHstX1SjF5q6nluPX7BYcT147KsxbiN1D1peWadpCcShXW3RdSBShpo63Q8uFx4OfRMb57BqVsqSGNPEoZHkcbz5ja-NOeR9C62-pwg5JpLktN4YtG_ku3Tv90O1wd53Py0x9KxUfavLgYtDmUGxvgKLNQV8Fq5XP_VJrK_jLMqLJtiyEwmXoYaSUH-1Sr7ypZAT-6LRP1rGq-VHGlniRXi8NKXPhaYyQ1I0hksDgA0no1qeudHcjF3sH6rknADLUvaEd5QR&p=4&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "Skills: multiparameter flow cytometry, immunology, immunophenotyping, life sciencesLASE Innovation is an early-stage startup that aims to provide innovative optics solutions for broad applications. The company is currently targeting life science and diagnostic markets by commercializing LASE Particle (LP) technology initially developed at MGH, Harvard and MIT. LPs are novel laser-emitting nano\/micro particles that due to their narrow emission, provide orders of magnitude more colors than conventional fluorescent probes for multiplexing and cell tracking applications. The company aims to release its first products including consumable LPs and life science instruments for single-cell analysis by the end of 2021.Responsibilities:We are seeking a highly motivated, energetic individual to join LASE Innovation as an Application Engineer. This individual will work with the Engineering team to develop and improve workflows pertaining to flow cytometry and to ensure suitability for customers. Responsibilities include:Design and optimization of high marker flow cytometry panels for deep immunoprofilingIdentify customer needs and user specifications of LASE flow cytometer productsDevelop and verify applications of LASE flow cytometry, including experimental design and workflow optimizationClosely interface with Marketing and Sales to create a product demonstration strategyCommunicating with customers to facilitate product adoption and gain user insightsOversee academic and industry collaborations to procure generated data for whitepapers, application notes, and presentationsRequirements:Bachelor’s degree in either the life sciences, immunology, or biotechnology; master’s or doctoral degree holders preferred.At least 8 years’ experience in research or clinical flow cytometry. Experience in both is preferred.An extensive knowledge and experience with flow cytometry instrumentation, reagents, protocols, software platforms, and the competitive landscape.Keen on working with new technologies and solving difficult problems.Resourcefulness, excellent verbal communication and writing skills, and ability to work well in a small team.Benefits:LASE Innovation is currently situated within the Walden Square Science Center near Porter Square. Benefits include:Attractive equity packageCompetitive benefits package including health, dental, and vision plans, for themselves and their dependentsTax-advantaged transit passes (via MBTA Perq for Work Program)21 days of PTO per year, with 5 days of rollover permitted each yearFree refreshments and snacksAt LASE Innovation we strive to create a healthy and productive work environment, free of harassment. LASE Innovation is also an equal opportunity employer. Hiring decisions are merit-based and depend on business needs and candidates’ qualifications. Candidates will not be discriminated based on their gender, race, ethnicity, religion, health status, age, family or parental status, or political beliefs.Job Type: Full-timePay: $80,000.00 - $120,000.00 per yearBenefits:Dental InsuranceHealth InsurancePaid Time OffVision InsuranceSchedule:Monday to FridayExperience:Flow Cytometry: 8 years (Required)Education:Doctorate (Preferred)Location:Massachusetts (Required)Work authorization:United States (Required)Visa Sponsorship Potentially Available:No: Not providing sponsorship for this jobCompany's website:laseinno.comBenefit Conditions:Only full-time employees eligibleWork Remotely:No"
}, {
    "unique_id": "pj_1ae9d574b6f0fc8c",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Senior Product Analyst",
    "company_name": "Therapy Brands",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Therapy Brands",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0DWzmAA4D_WVD5cyOYH3nJamrzsUZoGan403fICSzEd_OHCQcvwEGEMV0Ub-yLEBu1uwIwh5DHReS9AlSxYy-Blyx5bpAM-tdzb-3Ftzcaxkg2J-mkgq92c4-9nR0M6YDDBUJTzwA4kLPBDOmbPvPfOp1p9qe3v75jG08kT_WcJ05AQRxgcqVnNsknJDgm0I7BFRjx73ahOqfEvoMfY3JcksSk_5r-lsXbq1hCWjXWC8ZpaUIYcAJc7uffrxbYFcbT8eojN7w9TlTPRrQ0LvarapzlzPnBxdDiEIlZG_D5kuo_eFMQ2ZSEwr_1fWb65rr08B4S6MuAI645PsgUUEJdacI3tUOdSUGhGpkxQk1sahKR-X7hzxyo2DGiXAhowlYio_WKdI5KhDnAaAxEaKgJOFq42OULENrbbFRASXw62794Bo59O46VaOmhIb3We4afXbTKBu-utiEglUoq6-Wcq2AphKsoEHekOXSLJT9YmZn0Vf0fMXGPr7DLj9jM_GnC38yG7u5nBDssL72PRrde35TV_u8VCxqaae3dmd8xSmX9cpigBYnVqEl7_jmUvt0ovRNxsfWA222-K3ekFdf4CQx4lwwvAA0ImCgucdpIonXZDdyT5-V3bmyER58FgLv27lBr4paTQlhM_5EnJBhOYbXdqxE-SZ_A=&p=5&fvj=0&vjs=3",
    "date": "2 days ago",
    "full_text": "Make a difference by contributing to an industry and company helping others!\nTherapy Brands and our family of companies offer an exciting opportunity to make an impact in the mental, behavioral, applied behavioral analysis, rehabilitation and substance abuse spaces. We are industry leaders of end-to-end practice management, electronic health record (EHR) and revenue cycle management technologies and our customer-focused solutions drive user satisfaction through increased provider and patient engagement. Our customers are at the epicenter of everything we do and are the motivation behind our mission of serving the under-served. In short, we’re helping providers deliver better patient outcomes and experiences across the country.\nThe Agile Sr. Product Analyst serves as the voice of the customer and works on a highly collaborative, cross-functional agile team required to support the vision. The Sr. Product Analyst is responsible for leading and driving the development of the highest value projects for the Therapy Brands products. You will quickly become a key player in bringing strategic projects to fruition. Primarily, you will analyze software product requirements and deliver specifications for the product team, manage the delivery as well as coordinate product initiatives across departments.\nKey Responsibilities:\nDevelop a deep understanding of data collection products, customers, underlying datasets, and future product opportunities\nCollaborate cross-functionally to create a best-in-class user experience and solution\nClosely work with the product management team to understand the product vision, strategic product direction, and product roadmap\nMonitor customer feedback channels and conduct product research to gather information from various sources and tools\nMeet with customers and internal stakeholders to understand the business objectives and rationale behind specific customer requests\nSpecify and document software requirements in story format (as in agile methodology) with proper acceptance criteria that meet the business requirements\nResolve questions and provide clarifications raised by the engineering team during the development process\nReview and help with test plans to ensure that developed solutions will meet defined requirements\nAssist with product management for training and the demonstration of new product features\nMaintain a ranked backlog of new features, expressed in terms of epics and user stories, while prioritizing the needs of the product’s stakeholders\nActively participate in regular activities of a Scrum team, including inspection and acceptance\/rejection of completed work from each sprint\nMonitor and manage release communications\nQualifications:\nExcellent written and verbal communication skills with the ability to present and articulate complex business and software requirements in a clear and concise manner to a variety of audiences\nExperience working directly with customers to identify and prioritize product needs\nGood listening and negotiation skills – can find compromises and tradeoffs to maximize delivered value across all stakeholders\nStrong written and verbal communication skills\nHistory of working effectively with both executives and peers\nWillingness to be flexible while working within a small team\nCapable of being both a “big picture” visionary and a detail-oriented story author, as needed\nDesire to work in a fast-paced, success-driven team environment\nWell organized with the ability to prioritize and manage multiple complex projects\nUnderstanding of best practices in software requirements\nHave experience and a solid understanding of software engineering concepts and the agile software development life cycle\nHave a strong ability to effectively communicate business requirements to the engineers\nExperience in business or systems analysis in support of software product or application development.\n Bachelor's Degree\n Healthcare experience is a plus\n Experience with web technologies and wire-framing techniques is a plus\n We’re serious about team member well-being. That’s why we are proud to offer the following employee benefits including but not limited to:\n Unlimited paid time off for eligible employees\nGenerous Maternity and Parental Leave Plans\n11 paid Company Holidays\nComprehensive medical, dental and vision insurance available on day one\n401K Safe Harbor plan with company match and 100% vesting at time of eligibility\nMeeting-Free Fridays\nQuarterly paid Community Service day\nFor more information, visit us: https:\/\/www.therapybrands.com\/"
}, {
    "unique_id": "pj_f08c7068f88e34ff",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Senior Trade Controls Consultant",
    "company_name": "TRADE COMPLIANCE GROUP, LLC",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "TRADE COMPLIANCE GROUP, LLC",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0DQ7BU1rqy6qHZc-LX8BdU0O2Txh3Jq5IpkTpOFsA54QTNOAS7_HOtGP4EibuSU4uBdLBtbSvQN1CQdhnzS8LSi0EDPK0JKjgMAbZL0jDRD6BLE1sZXfMFrfLsdAnY6jF-kNN8mDW5kX7ZPhPY01b97p-Gudw7WqSde5_YujVQMbZtK3ir1g9xOyGIJt3cT4i0vW_ZxWq5IXfrCQJYhDObhptPK9Z7QuCgcwd8nzWH46T7dpn3wmGixR48R3jftOo8h20Ck2wZHpyMLl92pxzoQgpxJpNwG3xRcOVNw9BTgxvyZOyVuDpnijgEGy38dpASzad1RRWh_DRfyx203LH1kyXX4oKVj44-c2TXpsAN9VrTfopyDU2nxGqXaVOoUdf061un0tF3WVVi82hz8KUnZ-JnaVQQzVldCtLSpDzm5P3zGEgT3-HhGyZpyQtzEIH5Hv7TqGiJcHw==&p=6&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "Title: ITAR\/Defense Trade Consultant for the Trade Compliance Group, LLCSeeking ITAR expert with at least 4 to 5 years of experience.Assist clients with the development and management of comprehensive export and import trade controls to ensure compliance with US and foreign regulations in the conduct of international marketing, sales, supply chain and other business activities. On behalf of clients, obtain from the US government all necessary export and import licenses, permits, certifications, commodity jurisdiction, TAAs and technology release determinations. Establish and maintain relations with appropriate government regulatory agencies, including DDTC, BIS and possibly OFAC. Assist clients in operational processes for assuring trade compliance through gate reviews of technical data, foreign travel, foreign visits and export and import shipments. Assistant client in maintaining applicable trade compliance records in accordance with regulatory requirements. Support clients’ legal departments in investigating and resolving compliance problems, questions, or complaints. Establish and maintain training and audit assessment programs to ensure implementation and effectiveness of internal controlsBasic QualificationsBachelor's Degree and 3 years of experience. Master's Degree preferred. Eight years of non-related exempt experience can be substituted for Bachelor's degree. A relevant professional certification can be substituted for a Bachelor's Degree.Primary Preferred QualificationsExperience training employees in both formal and informal settingsAbility to develop creative course content and training materialExperience in conducting Defense Trade activities including regulations, licenses, agreements and their associated on-line systems, including DECCSExcellent writing abilityStrong customer service focusFluency in Microsoft Office ApplicationsDetailed administrative, reporting, and record-keeping habitsFamiliarity with laws and regulations governing Defense Trade including the AECA, ITAR and the USMLWorking experience in regulatory environment in the aerospace\/defense industryU.S. Security clearance is preferred but not requiredAdditional Preferred QualificationsDirect operational experience in the ITAR and EAR (e.g., obtaining export licenses, including writing agreement submissions and use of exemptions and exceptions)Direct operational experience processing international transactions (e.g., international shipments, international travel, foreign visitor requests, technology control plans)Direct operational experience conducting Denied Party Screenings, and use of related software search enginesAbility to work independently on complex tasks, to lead tasks or projectsSuperior communication skills for effective interaction with technical personnel, engineers, and all levels of managementStrong business acumenProvide guidance and interpretation of USG regulations including the International Traffic in Arms Regulations (ITAR), Export Administration Regulations (EAR),Support the implementation of corrective actions that result from export\/import compliance violationsConsult on temporary exportsReviews and updates Trade Compliance policies and proceduresConsult on foreign travel briefings and foreign visitor approvalsSupport the investigation of potential violations and collaborates with Trade Compliance management to prepare voluntary disclosures and track corrective actionsJob Types: Full-time, Part-timePay: $63,043.00 - $120,000.00 per yearBenefits:401(k) matchingDental insuranceHealth insurancePaid time offSchedule:Monday to FridaySupplemental Pay:Bonus payCOVID-19 considerations:Employees are working remotely from home or from their preferred location. No in person meetings. Zoom and equivalent."
}, {
    "unique_id": "p_472276f04f3af828",
    "city": "01002",
    "job_qry": "data",
    "job_title": "RN & LPN Needed - Hadley, MA and Springfield, MA",
    "company_name": "Pathlight Group",
    "location": "Hadley, MA 01035",
    "summary": "NOT_FOUND",
    "salary": "Pathlight Group\n\n\n\n2.9",
    "link": "\/rc\/clk?jk=472276f04f3af828&fccid=e2ef49c25bbf9ac6&vjs=3",
    "date": "2 days ago",
    "full_text": "RN's and LPN's - Pathlight has a rewarding work for you.\n Hiring and Retention Bonus Program available !\nAre you an RN or LPN looking for meaningful work that allows you to make a difference in the lives of individuals with complex medical needs, intellectual and developmental disabilities? When you join Pathlight, you join a team of dedicated, skilled, forward-thinking employees who are the source of Pathlight's ongoing success. We offer 24\/7 care to our clients and many of our positions can accommodate a variety of scheduling needs.\nSummary of position: Perform nursing duties to provide direct and indirect nursing care including health maintenance, teaching, counseling, planning and restoration for individuals' w\/developmental disabilities Provide support and instruction to families, daycare providers, direct care staff in keeping with Program policies, Nurse Practice Ace and related standards and accepted practice.\nSKILLS AND ABILITIES REQUIRED\nDiversified duties involving an intensive knowledge of nursing care and the use of a wide range of procedures.\nRequires the use of judgment in the provision of nursing care and in the determination of the best actions to be taken within the limits of accepted practice.\nWork with confidential data such as individual's served records, CPR certification.\n Qualifications:\nKnowledge of practical nursing requiring some advanced skills knowledge equal to high school plus additional specialized training.\n1 year experience preferred.\nValid driver's license and reliable transportation.\nPay Rate: LPN - $23.85\/hr - Overnight Pay Rate: LPN - $ 26.06\/hr\nPay Rate: RN - $28.50\/hr - Overnight Pay Rate: RN - $31.14\/hr\nPathlight offers a great benefits package *for eligible employees*:\nHealth Insurance\nDental Insurance\nPaid Leave\nSick Leave\nParental Leave\n403(b) MassMutual Retirement Services\nFlex Spending\nLife\/AD&D Insurance\nEmployee Assistance Program (Longview Employee Services)\nShort Term Disability\nApply Online today: https:\/\/pathlightgroup.applicantpro.com\/jobs\/1493915.html\n\nPathlight has demonstrated a commitment to issues of diversity. We welcome all applicants. EOE"
}, {
    "unique_id": "pj_d9cc6ae6de7099f1",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Senior Mortgage Underwriter",
    "company_name": "Solve IT Strategies, Inc.",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Solve IT Strategies, Inc.",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0CammtlZsNMhOhUjnDW0LiNDKVJS_5fLMN4VJ7UBDIEEEYIFtoiSssjNqVQT6UrxFokoMxzpMhRjADty4zisXm9pIvwvhJb23rGd6MS0nYyfW0loZWTa82wSdxnNMlUD08q252qJSSghw8wk2Ycrz1JZx4nX_70hhMmqOx8tzgApMHaAJfadQwQhGUE0_kcoCSiUi6Bt8DB1tnh16rgXcMJjIrhAraiTj0Fa2JTbNR4JWT-lOK43p3L0xSZrIuLOLlGFsfY_GwmgDu7excbck7n-AGmt2TGhh4mC-CkokfIawUR2RSUWxX1ycwhpumNiGXs7g_NikRlGIrQNuROOheJytgcY-zekE9TPV2xhaIQr77bWxhHLqxI2mh1nv1FdM1x1-KPba19Tv8uhFlAtspVTohvFbtsKtNeQCtodDEmt2jQH_tRf0mZ2Gzf-bX2acY=&p=8&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "The company is a national independent mortgage bank with all states licensing strategy. The corporate core mission is to create a culture of responsible autonomy (every one of their employees has the freedom and flexibility to reach their highest goals while remaining accountable for their decisions and results).Job Purpose: Analyze and evaluate residential mortgage loan applications and supporting documentation to assess a client’s creditworthiness for FNMA, FHMLC, FHA, VA, USDA and Jumbo residential first mortgages. Recommend approval or denial of mortgage credit applications and generate written documentation to support the lending decision.Duties and Responsibilities: Review and analyze borrower profiles, credit reports, income documentation, asset documentation and title reports.Ensure documentation is appropriate to support credit decision.Knowledge of complex personal and business financial analysis and expertise in tax return and balance sheet analysis.Underwrites residential mortgage loans in accordance with FNMA, FHMLC, FHA and internal guidelines ensuring compliance with company and investor standards.Run, review and interpret AUS data to ensure compliance with agencies AUS guidelines.Issue timely loan approvals or adverse action notifications.Analyze property appraisals for accurate property valuation for conventional FHA loans.Ability to properly assess and respond to fraud indicators.Provide proactive communication to Loan Officers, Processors, and internal business partners involved in the loan transaction.Qualifications: More than 5 years mortgage underwriting experience.Must have extensive knowledge of state and federal residential lending regulations.DE-CHUMS ID, VA-LAPP and\/or USDA-GUS experience preferred.Experience with Encompass 360 preferred.Customer experience focused.Strong interpersonal and teamwork skills and ability to influence through collaboration.Self-motivated, high level of personal energy and commitment.Possess exceptional organizational, problem solving and communication skills with strong attention to detailAbility to handle multiple tasks, take on new responsibilities and prioritize work in a deadline intensive environmentCompany Benefits: Remote PositionsRobust Medical, Dental, Vision Insurance401kLife InsurancePaid Time OffPaid HolidaysJob Type: Full-timePay: $85,000.00 - $110,000.00 per yearBenefits:401(k)Dental insuranceFlexible scheduleHealth insuranceLife insurancePaid time offVision insuranceSchedule:8 hour shiftDay shiftMonday to FridaySupplemental Pay:Bonus payExperience:FNMA, FHMLC, FHA, VA, USDA and Jumbo: 5 years (Preferred)Mortgage Underwriting: 5 years (Preferred)state and federal residential lending regulations: 5 years (Preferred)License:direct endorsement (DE) (Preferred)Work Location:Fully RemoteWork Remotely:Yes"
}, {
    "unique_id": "pj_f96275db4ed69847",
    "city": "01002",
    "job_qry": "data",
    "job_title": "RDK Developer - REMOTE",
    "company_name": "Computer Enterprises Incorporated",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Computer Enterprises Incorporated",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0AVVnl_N3xmP3MApcGA3sr6MLnz8P423WWILI1WvbjE8Ry71v-lom9NKs8rBQiPPScOMsGlTKLTTYioVq_3_JhoSnwW9IBDGl6jB2ifdU7cr9qu4VnB2YGTz9CrnhkLj7os_rrS3haWXBxTCuedYEzVqftjBDlkQpebw_rPucbQ1G3ZfP2opD7RRrxtg1ssgIkTrvymySeB9vIF-XWWWbMfkf0mMcWj3Qaau-REkJZFSgV3WKoITJZ8LN7uoU2GzywqSJZM2nXqs2WNdqq91O53ugne97rODPLXItB_J-E9Ph7SVRnYCF-l0m0ntpaMp7TGKcxIUZIwpK_wJGDib8YsWXhIeKaIiHWRLAdUgjxLyPDlubHqQK7S9Bt1U2AhmVdqjjg5nlGpUASHPA4VSyohe_uL5GS_zcDJ-WRAx6ZOcIAL223w2vWAQyMf0RFLknQ=&p=9&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "CEI is looking for an RDK Developer to assist our client 100% remotely! Candidates should have a minimum of 2 years of experience utilizing Agile methodologies to design and develop software for the RDK software stack, including utilizing build tools and services such as YOCTO Build Framework, LINUX, C, Python, and Shell scripts; as well as experience utilizing network protocols, including TCP\/IP and UDP.***This is a W2 Hourly Contract, the rate is $50 \/ HR + benefits and the term will likely extend through 2021***Job Description: Codes software applications to adhere to designs supporting internal business requirements or external customers. Standardizes the quality assurance procedure for software.Oversees testing and develops fixes.Relies on limited experience and judgment to plan and accomplish goals. Performs a variety of tasks. Works under general supervision.Monitor and maintain operational readiness of Middleware Applications including applications hosted in AWS cloud.Identify opportunities for system enhancements that will deliver enhanced functionality and\/or simplify system administration. Facilitate and develop plans for application changes (including defects fixes, enhancements and\/or configuration changes).Configure and test changes to system including reports, security access, and workflow. Perform\/Coordinate configuration changes to the production environment.Work closely with BA\/QA team members to create test plans and ensure that issues are properly identified, fixed, and tested.Required Skills:Two (2) years of experience utilizing Agile methodologies to design and develop software for the RDK software stack, including utilizing Build tools and services such as YOCTO Build Framework, LINUX, and C, Python, and Shell scripts; and utilizing network protocols, including TCP\/IP and UDP.Preferred Skills: May require a bachelor's degree in a related area and 3 years of experience in the field or in a related area. Has knowledge of standard concepts, practices, and procedures within a particular field.Ability to work in a collaborative environment and coach other team members on coding practices, design principles, and implementation patterns that lead to high-quality maintainable solutions.Services – moderate-level implementation skills in building highly scalable services (SOAP and REST)Spring – moderate-level implementation skills with the Core Spring Framework and including other sub-projects like Spring JMS, Spring Security, Spring Data and Spring Integration.Skilled at building modern REST Web servicesExperience with additional scripting languages such as Python and Ruby a plusExperience consuming API\/web-based servicesExperience with HTTP and TCP\/IPA certain degree of creativity and latitude required. Typically reports to a project leader or manager.CEICOMJob Types: Full-time, ContractPay: From $50.00 per hourBenefits:401(k)401(k) MatchingDental InsuranceDisability InsuranceHealth InsuranceVision InsuranceSchedule:8 Hour ShiftDay shiftMonday to FridayExperience:User Datagram Protocol (UDP): 2 years (Required)YOCTO Build Framework: 2 years (Required)TCP\/IP: 2 years (Required)RDK\/Set-Top-Box Development: 2 years (Required)Linux: 2 years (Required)C \/ Python \/ Shell scripting: 2 years (Required)Contract Length:5 - 6 monthsVariesContract Renewal:LikelyWork Location:Fully RemoteCompany's website:https:\/\/www.ceiamerica.com\/Company's Facebook page:https:\/\/www.facebook.com\/computerenterprisesinc\/"
}, {
    "unique_id": "pj_ca1acfafa7d95108",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Loan Credit Advisor- *Fully Remote, Accepting Candidates Nationwide!*",
    "company_name": "Harrison National Employment",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Harrison National Employment",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0Afi0sXm9gnkv3-uFz6ngakMeWCwjUzS9rrHDpAW-UpmLiqpg0yv8mnAseFR4A2GRLAomy4mGGXAEgyOSnidpogjOocLBohnr9inNj3ChwU-wwXSwf3FuStLf4xfYaOyisYxpUxR1nH37CZpHwUipZzHEdlrgeDy1qbi5kQ6CV8fKXLNDrj7a9fYJl9dCQK9FiLsKeBjwg0IMhAA4YeDnFGJA4uOolr8khJ9roRpPIlS_-asxa4B8LrGhsBnRrGVOSGqLHaHFkcf0CeTN5KlvSZ-1S3Av8rZZXVggLcycRh3xHZpu1ZeF-9H39Cx8ylPLLbiXe2uBqOcUivR_WNz90LNViam4QLxIvOq4NgS3O8yUOKOSpx5KMo2i9jvnABN92lhoqreSwBaPXXayDOmelk6kEpnbePmNifawZnW6z0WQpLUiI5tPC8lFPCKx1oNJw4toMPoN-V3Inr4RwMj9isjItMsKRW3HNkzYJWtwjVp7XDQGgiLrxa4KgoPR70rEg=&p=10&fvj=1&vjs=3",
    "date": "2 days ago",
    "full_text": "The Loan Credit Advisor\/Underwriter is responsible for reviewing loan applications in conjunction with Credit, Income, and Asset documentation to determine if the loan is to be submitted to Call Center Operations. This position is responsible for performing duties such as calculating income, analyzing loan applications, assessing creditworthiness, and the likelihood that a loan applicant will be able to repay the debt and analyzing the AUS \/Guidelines as they pertain to the loan product. Will work alongside sales, providing guidance to Loan Advisors to ensure that the borrower is being put into the product that provides the most benefit given their individual profile. Product knowledge must include expertise in processing and underwriting VA, FHA, Conventional and Non-QM loans.Job Functions may include:Co-Located within Sales. Works directly with Loan Advisor to provide clear direction as to what is needed from the borrower in order to have a completed loan application. Requests and reviews the appropriated credit, income and asset documentation, and reviews alongside the application for data integrity. Calculates income in accordance to agency\/investor guidelines for all income sources. Reviews and updates liabilities in accordance to agency\/investor guidelines. Creates a needs list to be distributed to sales, operations and borrowers, detailing the items required for processing of loan. Runs the corrected\/completed loan terms thru the appropriate Automated Underwriting engine, recognizing when a manual downgrade is required STIPS file. Recommends denial status for loans not meeting minimum standards. Works directly with Loan Advisor in re-structuring loans as necessary after documentation has been analyzed. This will include but not be limited to a proposal to pay off additional debt and\/or proposing new loan product(s). Provides feedback and training to Loan Advisor. Train employees involved in the process of how to handle all products. Assigns file to self and reviews CIA info to confirm no issues. Sets PGR Trk item to be completed in Lakewood. Authorizes loan to be sent to Processor.To perform this job successfully, an individual must be able to perform each essential function satisfactorily. The requirements listed below are representative of the knowledge, skill, and\/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of the job.Ability to work flexible hours as needed. Ability to function in an ever-changing team environment. Demonstrate strong interpersonal, organizational, and time management skills. Ability to solve problems. MS Office proficient. Excellent customer service skills with strong attention to detail. Requires good analytical and math skills, strong oral and written communication skills, and outstanding computer skills.Education and\/or Experience:High school diploma or general education degree (GED) required; Bachelor’s degree preferred. 5 years related work experience in residential mortgage lending processing with underwriting experience. Current Mortgage Loan Processing knowledge. Product knowledge must include expertise in processing and underwriting VA, FHA, Conventional and Non-QM loans.Job Type: Full-timePay: From $65,000.00 per yearBenefits:401(k)401(k) MatchingDental InsuranceFlexible ScheduleHealth InsuranceLife InsurancePaid Time OffVision InsuranceSchedule:Monday to FridayExperience:Underwriting: 2 years (Required)Mortgage Processing: 1 year (Preferred)Application Question:How would you calculate standard income based off of an applicant's pay stub\/ what is it on the paystub that would make you decline the loan?Work Location:Fully RemoteThis Job Is Ideal for Someone Who Is:Dependable -- more reliable than spontaneousPeople-oriented -- enjoys interacting with people and working on group projectsAdaptable\/flexible -- enjoys doing work that requires frequent shifts in directionDetail-oriented -- would rather focus on the details of work than the bigger pictureAchievement-oriented -- enjoys taking on challenges, even if they might failAutonomous\/Independent -- enjoys working with little directionHigh stress tolerance -- thrives in a high-pressure environmentBenefit Conditions:Waiting period may applyOnly full-time employees eligibleWork Remotely:Yes"
}, {
    "unique_id": "pj_503fe8516ef0faa5",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Insurance Customer Service Representative",
    "company_name": "JMT Staffing Solutions",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "JMT Staffing Solutions",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0A-1bYKC4o2O4RCd_9G5tt91XT6D6Wa_SYqwQ8kQW1P0muLgqfIjCrsZr8A7HcwNwMUpXOVtqRwVQgTItJ1cy1BghWS279Exxs0aWJF1lFnbgawF3IN5Z10wh0_AuXj4YfkGcWGf6aNDnumeA3bN3qBM0v_zpqOxojIdOjsqsc4-mTC7fPXPfOs2VZVzTPxpMVn0tnVRsuKW5pZAtNopirKUKFI2pFGvygXvobt5kWFWwPP1fKmrIvnwcZKjBI3PS8EjwF_wH67Ejm1spPUMj-ZYfMNuaby2S_pDiEaGVBx0JMm2ZYhPyMVIRwz6SYwCuXjGfAqnmu_m6ghwPcTKB75Yrp34TfVCvkKqudmDQ8EswdB47hKmvokcNWyeByVD9j8qWOU1a69DpEMuXHWRTHCui3ieDo-VufTbAdN-zk2iiC-2AbWNpmKxz567ezuURuOMlsSxxg4vDSb3RPYBL_xHlHFv0sKYHs=&p=11&fvj=1&vjs=3",
    "date": "3 days ago",
    "full_text": "JMT Staffing Solutions has partnered with a growing insurance company in Sunderland, MA to identify a customer service representative to join their team on a temporary to hire basis. Your duty as a customer service representative is to respond to all inquiries in an efficient and timely manner.Primary Responsibilities include;Respond to inquiries via phone, email and fax.Answer questions pertaining to insurance policiesAssist with renewalsObtaining relevant documents to ensure complianceData entry into the databasePrevious insurance experience is preferred, but not required. Candidates should have strong customer service, time management and data entry skills. Full Time hours, Monday through Friday.This position will be Working From Home. Candidate must have their own computer that meet minimum set requirements and a reliable internet connection.Please apply today through Indeed or contact us at 781-558-2589 for immediate consideration!Job Types: Full-time, TemporaryPay: $13.00 - $15.00 per hourSchedule:Monday to FridayExperience:Call Center: 1 year (Preferred)Insurance: 1 year (Preferred)Education:Associate (Preferred)Communication method(s) used:EmailPhoneWork Remotely:No"
}, {
    "unique_id": "pj_62b4e7c01b59637c",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Developer Advocate",
    "company_name": "EDB",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "EDB",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0AspgLJcDMzTkqqjIZjVsplAfi3WddyqtxGP_9r8DiWtqaUoQ92Uv215WkDQfftXTl30adCQpTkA4eIPOusYgNj86uILeerNwBrKzcWtkXSz8zuI40mECnlrdvkwa3AtTclJH1NHQ2lDEoZ7W-IB1s-q_wJ2CKQpe4d1ZQbl4ZecjywaDYecRq_uTISZDd49vi7DENoyCMXJavS-SY43W7QCtRDa0u_NWkqO2jw2nO17wzjIkYDZF0iswyIxF89FgdhcgfATJmftnSZH2KeymK--wTtELI6NEpeJDRCUl0epjQwZWv4xYtNJybZN8X3E9ZeXZcuc8JMrzqgqjbv0IBkfNRNZjDP4c-GBkKd325kyalu1fQC4lPNfq9apIBCsGOmGZbOMDb1FODhEa7BRbPITpycnEQuS2raoUkfq7LFG-pFSNLW8fL2hBzifNOnAghjGPzY8obkqoVUOqgOOUEqSD9ipXSJWj6HlWIFjAN9xBauTqYLdwCu&p=12&fvj=0&vjs=3",
    "date": "3 days ago",
    "full_text": "Developer Advocate\nRemote preferred!\n\nThe world loves Postgres. If you work with developers or data scientists or anyone wrangling data, you’ll probably see a sticker with the tusks and trunk of the Postgres elephant on the lid of a nearby laptop. EDB has a lot to do with that.\nWe’ve been major contributors to Postgres since the beginning, and we are proud to call thousands of boundary pushing customers our partners. Proud though we are, we are not resting on our laurels. There’s plenty of work to do. The good news is that everything we do will impact Postgres, which is to say that it will impact the world. No pressure.\nAs a Developer Advocate, you will join a team of user experience and software development professionals on a mission to make working with Postgres easier, for developers, data scientists, data wranglers, operators, and the ever-expanding ecosystem of technologists who rely on Postgres to innovate at speed.\nWhat you’ll do\nMake Postgres easier: identify points of friction in Postgres and EDB products, develop approaches to address them\nContribute Postgres expertise to a number of communities, including Node.js, Python, and Go\nIdentify and engage with new communities which stand to benefit from Postgres\nPublish code and content that will help others get started with, and get more out of, Postgres\nShare feedback to development teams across our portfolio\nCollaborate with product, engineering, and marketing teams\nTalk to Postgres users and EDB customers and listen for not only their needs but also their ideas for the future of Postgres\nWhat we’re looking for\nA strong communicator\nA robust online portfolio featuring code and technical content, including READMEs\nIdeally, experience working on a technical advocacy team\nFacility with modern communication, collaboration, and development tools; e.g., Slack, Github, Stack Overflow, VSCode, Jira\nExperience with agile methodologies\nWillingness to analyze, understand, and extend existing cultural and technical systems\nDeveloper Advocates will report to the Director of Developer Advocacy, in the CXO organization."
}, {
    "unique_id": "p_f95640ae763b2cdc",
    "city": "01002",
    "job_qry": "data",
    "job_title": "ACE Assistant Grant Specialist: Northeast Region",
    "company_name": "American Conservation Experience - EPIC",
    "location": "Hadley, MA",
    "summary": "NOT_FOUND",
    "salary": "American Conservation Experience - EPIC\n\n\n\n4.1",
    "link": "\/rc\/clk?jk=f95640ae763b2cdc&fccid=cb79339fb9178ce7&vjs=3",
    "date": "3 days ago",
    "full_text": "Summary: American Conservation Experience, a nonprofit Conservation Corps, in partnership with USFWS Northeast Regional Office, is seeking 1 Individual Placement to work directly with the USFWS Northeast Regional Office staff and assist senior staff with competitive and land acquisition grants. Valuable work experience will be gained under the Division of Wildlife and Sport Fish Restoration (WSFR) in administration of grants to state fish and wildlife agencies and Native American tribes.\nThe Assistant Grant Specialist will assist senior staff (biologists and realty specialists) who partner with state fish and wildlife agencies, Native American tribes and conservation organizations throughout the Northeast to achieve on the ground conservation results. WSFR annually administers over $200 million in about 800 grants primarily to state fish and wildlife agencies to conserve fish and wildlife species and their habitats, provide for aquatic resource and hunter education programs, and expand and improve fish and wildlife-oriented recreation and boating access opportunities for the public.\nThis opportunity is intended for enthusiastic young professionals with a deep interest in advancing their career goals in the USFWS or natural resources management on public lands out of the Northeast Regional Office, USFWS.\nStart Date: September 2020\nEnd Date: 52 weeks later\nLocation: Anywhere, remote position\nProject Website: USFWS Regional office, Hadley Massachusetts. For more information about the Northeast Regional Office, please visit: https:\/\/www.fws.gov\/northeast\/\nFor more information regarding the ACE EPIC Program, please visit: www.usaconservation.org\nCompensation: ACE Member is expected to contribute ~40 hours\/week and will receive a living allowance of $700 \/week to cover the costs of food and incidental expenses, dispersed bi-weekly.\nHousing: No housing available. No housing, living, or relocation allowance provided.\nPosition Description:\nGeneral grant administration assistance - 60%\nAssists WSFR senior staff with all aspects of grant administration. Maintains or gains knowledge of realty documents and conducts initial review of land acquisition performance reports for completeness. Enters data into Regional Land Records, TRACS and ECOS databases as needed. Assists with assessing compliance with the National Environmental Policy, Uniform Relocation Assistance and Real Property Acquisition, Endangered Species, and National Historic Preservation Acts as requested. Summarizes information as needed to respond to data calls on grant outcomes. Participates in field reviews of WSFR grants when appropriate and prepares first draft of trip reports or other follow-up communications as requested. Follows up on special grant conditions as needed.\nCompetitive Grant Program coordination - 20%\nAssists WSFR senior staff with coordination of ranking processes for competitive grant programs. Prepares proposal packages, application databases, and scoring materials for ranking committees; participates in ranking; summarizes final results of merit review process; and drafts award letters and notifications to applicants not selected.\nTechnical Advice, Consultation, and Training 20%\nAssists senior staff with providing technical assistance to States and other grantees. Conducts special projects and research as needed to address emerging needs identified by the program. Assists with development of communication products as needed. Helps senior staff with sharing best practices across states.\nQualifications: Applicants must have a degree (or be pursuing a degree) in wildlife biology, ecology or other related disciplines appropriate to the position. A combination of relevant education and appropriate experience is also acceptable.\nRequired:\nFellowship is available to US Citizens and Permanent Resident only\nFellow must be between the age of 18 and 35\nEffective communication skills\nExcellent writing, editing, and organizational skills\nAbility to gather, organize, and interpret literature and relevant source materials\nAbility and willingness to undergo a Federal criminal background check\nPreferred:\nStrong desire to enter the public service field as a natural resource professional\nACE Interns must be willing to represent ACE and the partner organization in a professional, positive, and enthusiastic manner. Drug users should not consider applying, as ACE reserves the right to require drug testing.\nThis will be a fully remote position due to the impacts of COVID-19. The assistant grant specialist will be expected to work responsibly from a remote location, following USFWS telework policies. Remote employees are expected to follow all the same policies regarding work hours as those reporting to the office.\nPLC Competitive Hiring Authority: This position is authorized by the Public Land Corps (PLC) Act of 1993 and expanded by the Public Lands Service Corps Act of 2013. Interns who meet basic requirements during their term of service may be eligible to receive their Noncompetitive Hiring Eligibility Certificate to be used when applying to future federal jobs. Requirements are: (1) Intern must be between the ages of 18 to 30 and (2) Intern must complete at least 640 hours on a federally approved PLC Project. More information can be provided upon request.\nEOE: American Conservation Experience provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, American Conservation Experience complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities.\nTo Apply: Please submit your resume, thoughtful cover letter, academic transcript (required) and contact for three professional\/academic references to the online application page for this position here: https:\/\/usaconservation.applicantpool.com\/jobs\/\nNOTE: Early consideration will be given as resumes are received. This position may close at any time. If you have any questions regarding this position please feel free to contact ACE EPIC USFWS Recruitment and Member Manager, Melissa Early, at 801-573-8984 or mearly@usaconservation.org."
}, {
    "unique_id": "pj_876d59b63c4ddd6b",
    "city": "01002",
    "job_qry": "data",
    "job_title": "Retail Coverage Merchandiser",
    "company_name": "Acosta, Inc.",
    "location": "NOT_FOUND",
    "summary": "NOT_FOUND",
    "salary": "Acosta, Inc.\n\n\n\n3.0",
    "link": "\/pagead\/clk?mo=r&ad=-6NYlbfkN0ClkhXtocMVFDWR67Kg4TlfeT56GBiw3nIhj-oEf26CJtXpBjd7KD7RHsvy0Nkb9WICXORedLLqcNxfRwASPgLZRi_siRcPz4_NqeNJla1ulHq9Vpn7PAydVNWdoSfVQt4Hns-VXsjMkU0BdCK7AzOt_5V5aXXNHPMWgxkhZc_NaIsXiDzJuAv8hxXBlaCeaZoCny1F7mbpAHXnhJVN3NJkGAeDYCRb5orUi2YdOVCZ7yudNifMIIax31nK0PN5gSA9Mnm5DlxtELKVkygZtb1yJLTbl-UWi7A34mWuwtJaJPa6QDtCTKgQ7Yr23FTepuhaU0Yog2cddTjHz5NPB1wjvEbVHZ6pRwXSIBcS6h_lKbXUOZrKbpRe385fXN71o7ot3--LWuX3eWAZ9BTSrZrD64ntwgRcolwIDWPqe17Z7cfulng33V3l-dkhQnBNUwiOXJJQl0oGWEP6Oc9YZZPL8YL_eg-QykURUnGEoVet6_OcAHcIOyoUS0TeDb7lJWFa4giHnT4s2Bo0mXjd8Y4exLwiOt18ZOyk3eQDZtFuckQV5q3cflIXn5nQbqpDP0oFSplVqzBrcK9Uv08Lv7xUplM2eanp-1lJtd17IvtqqDbu6pDMrnB4ohLdTCRutd2hTXmZYVu_2L-joJR0Baqw68tTk7FfnZ44foAKIwq-RaP9KqPZJ6bgKsTA8QQbzbfO7wxGof0jNfe3gt_P26Ql-DA_YNv34DGs6Yp0NC293K_rY-meCwI3wJyKuWhp-bk1zQop6bn6sVLjoPjkSclRo2WCFuk7XirFowtjaYNnl7zoEV00P42W&p=14&fvj=0&vjs=3",
    "date": "3 days ago",
    "full_text": "Overview:\n\nThe Retail Coverage Merchandiser primarily provides retail sales merchandising coverage and coverage of retail special projects for an assigned retail territory. They are responsible for representing ACOSTA and our principals through store coverage and executing objectives as set forth by their Manager to achieve superior in-store results in an assigned territory.\nThe incumbent(s) in this position should exhibit the following ACOSTA values:\nPeople Minded – Must show dignity and respect to all peopleIntegrity – Must exemplify the highest degree of ethical behaviorResults Oriented – Must show passion, pride and commitment to succeedTrust – Must be honest, sincere and confidentTeamwork – Must build trusting relationshipsInnovation – Must progress through a combination of creativity, common sense and visionBalance – Must maintain an optimistic attitude and keep perspective on what is important in life\nResponsibilities:\nAs established by management, deliver retail sales merchandising goals across all principals in assigned territories.\nMeets client expectations regarding retail sales coverage and productivity in assigned territory.\nAssists supervisors on retail initiatives (new product introductions, contests, etc.) as assigned.\nAs established by management, enters and transmits data in a timely manner.\nExecutes retail territory coverage plan to ensure merchandising coverage goals are met.\nExecutes personal Performance Agreement.\nExecutes merchandising events in assigned territory.\nFollows Company policy in execution of work.\nPerforms special projects as assigned by Manager.\nMaintains full distribution and display of products in assigned accounts per plan-o-gram.\nRotates stock, clean and stock display and price merchandise as appropriate.\nPerforms such duties as checking date codes, ensuring adherence to approved plan-o-gram.\nReports observations to Unit manager regarding outdated product, unbalanced stock, out-of-stock situations and point of purchase requirements.\nOther duties as assigned\nQualifications:\n\nMinimum Education Requirements:\nHigh School Diploma\/GED\n\nExperience Requirement:\nStrong demonstration of the following core competencies: Quality Commitment, Detail Oriented; Customer Service, and\nCommunication Skills\nMust be comfortable utilizing Technology\n\nKnowledge, Skill and Ability Requirements:\nMust be able to lift up to 30 pounds.\nMust have a valid driver’s license and must be able to drive a car for extended periods of time.\nMust be available for occasional weekend work (Demos and Food Shows). Must be able to work nights and holidays. (Night and holiday work will be pre-defined by position).\nMust be willing and able to work in extremely cold conditions (i.e. refrigerated and freezer sections of retail stores).\nMust be able to effectively communicate with others. Must have good vision and be able to operate a calculator, fax machine, telephone, copier, hand truck, hammer, and screwdriver and case cutter.\nMust be able to stand and\/or walk for long periods of time."
}]